const express = require('express');
const cors = require('cors');

const bodyParser = require('body-parser');
const app = express();
const port = process.env.PORT || 5000;

app.use(cors({
    origin: '*'
  }));
  app.use(bodyParser.json());

/*====================================================================ดวงประจำวัน================================================================================*/

const horoscopes = {

วันอาทิตย์: [

"การงาน เตรียมรับมือกับพายุงานที่มาจ่อรอที่โต๊ะทำงานได้เลย" +
" การเงิน ช่วงนี้การเงินดีไม่มีปัญหาอะไร" +
" ความรัก คนมีคู่เสน่ห์แรงจนทำให้บางคนตกหลุมรัก คนโสดมีโอกาสได้พบรักแบบงงๆ\n\n" +
"สีมงคล : ทอง, ดำ\n" +
"เลขนำโชค : 0, 5, 6, 8, 9",
 
"การงาน ดินฟ้าอากาศเป็นอุปสรรครอเวลา ขอให้ผ่านเรื่องเยอะๆนี้ไปกันก่อน ได้กำลังใจผู้ใหญ่คอยช่วย" +
" การเงิน อะไรได้เงินคว้าไว้ก่อน ไม่อยากทำเหนื่อย โอกาสไม่ได้เข้ามาบ่อยๆ" +
" ความรัก ต้องการความช่วยเหลือจากคนรัก รับผิดชอบเองไม่ไหว คนอย่างฉันก็อ่อนแอเป็น\n\n" +
"สีมงคล : แดง, ชมพู, ม่วง\n" +
"เลขนำโชค : 4, 9 ",

"การงาน ทำงานอิสระประสบความสำเร็จ" +
" การเงิน หาได้ทันใช้ทันจ่าย" +
" ความรัก พบข่าวดีเรื่องความรัก\n\n" +
"สีมงคล : เขียว, ส้ม\n" +
"เลขนำโชค : 4, 5, 6"
],
วันจันทร์: [

"การงาน มีเรื่องหนักใจบ้างแต่สุดท้ายทุกอย่างจะผ่านไปได้ด้วยดี" +
" การเงิน มีเรื่องให้คุณต้องควักกระเป๋าจ่ายตลอด" +
" ความรัก คนมีคู่ความสัมพันธ์รักดีขึ้นมาก คนโสดมีเกณฑ์พบรักแท้ที่ตามหา\n\n" +
"สีมงคล : เขียว, ส้ม, เหลือง\n" +
"เลขนำโชค : 4, 6, 9",

"การงาน แก้ไขปัญหาเฉพาะหน้าให้ผ่านพ้นไปได้" +
" การเงิน พบอุปสรรคทางด้านการเงิน" +
" ความรัก มีโอกาสได้พบคนผิวขาวเหลือง\n\n" +
"สีมงคล : น้ำตาลอ่อน\n" +
"เลขนำโชค : 4, 5, 6, 8, 9",

"การงาน ถึงแม้เป็นวันเดินทาง การจราจรติดขัด งานสายไม่ราบรื่น ต้องช่วยเหลือแบ่งปันงาน" +
" การเงิน อย่าหมิ่นเงินน้อย เล็กน้อยก็เงิน โอกาสสร้างรายได้ กล้าเริ่มและเพิ่มเอง" +
" ความรัก ติดอยู่เรื่องในอดีต น้อยใจคนรักเก่าสร้างปัญหา\n\n" +
"สีมงคล : ส้ม, ม่วง\n" +
"เลขนำโชค : เลขจากเลขที่บ้าน"
],
วันอังคาร: [

"การงาน มีบางอย่างที่ทำให้คุณกลัดกลุ้มอยู่ในอก แต่อีกไม่นานจะคลี่คลาย" +
" การเงิน พอเงินเข้าปุ๊บก็ออกปั๊บ" +
" ความรัก คนมีคู่เริ่มเข้าใจกันมากขึ้น คนโสดยังไม่มีเกณฑ์ได้คู่แบบจริงๆจังๆเสียที\n\n" +
"สีมงคล : ม่วง, ชมพู, แดง\n" +
"เลขนำโชค : 2, 7, 9",

"การงาน ทำธุรกิจด้านบันเทิงประสบความสำเร็จ" +
" การเงิน ผู้ใหญ่จะให้ความช่วยเหลือทางด้านการเงิน" +
" ความรัก เกิดความสัมพันธ์ที่ดีกับคนรัก\n\n" +
"สีมงคล : ดำ, ชมพู\n" +
"เลขนำโชค : 1, 2, 4, 6, 7, 9",

"การงาน แก้ปัญหาซ่อมแซม ยังไม่ถึงวันทำงานแต่ต้องเริ่มแล้ว เคลีย์งานเก่า" +
" การเงิน เซฟค่าใช้จ่าย ระวังเรื่องการใช้เงิน ไม่มีเวลาใช้เงิน" +
" ความรัก อึดอัดใจ กลืนไม่เข้าคลายไม่ออก มีเรื่องให้เครียด ไม่ไว้ใจกัน\n\n" +
"สีมงคล : ชมพู, ส้ม, แดง\n" +
"เลขนำโชค : 6, 8"
],
วันพุธ: [

"การงาน คุณจะเหนื่อยมากแต่ความสำเร็จก็มากเป็นเท่าทวีคูณ" +
" การเงิน ช่วงนี้การเงินดี คิดเงินได้เงิน คิดทองได้ทอง" +
" ความรัก คนมีคู่ยังรักกันเหมือนเดิม คนโสดมีโอกาสพบรักเพราะการงานเป็นเหตุ\n\n" +
"สีมงคล : เขียว, ส้ม, น้ำตาล\n" +
"เลขนำโชค : 0, 1, 9",

"การงาน เกิดการเปลี่ยนแปลงโยกย้ายแล้วสำเร็จ" +
" การเงิน จะได้พบผู้อุปถัมภ์" +
" ความรัก ได้พบคู่บุญ\n\n" +
"สีมงคล : ขาว, เหลือง\n" +
"เลขนำโชค : 0, 1, 3, 6, 8, 9",

"การงาน ได้ยินข่าวไม่ดี มีเรื่องให้เครียดไม่สบายใจ สัญญาเรื่องงานไม่ค่อยดีเท่าไหร่ ต้องรีบเช้าไปเคลียร์แก้ไข" +
" การเงิน จ่ายค่าปรับ เสียเงินจากความผิดลพาด หักเงินเดือน" +
" ความรัก อยู่ให้ห่าง อารมณ์ไม่ดี อย่าเซ้าซี้เป็นพอ\n\n" +
"สีมงคล : ส้ม, ดำ\n" +
"เลขนำโชค : 3, 6"
],
วันพฤหัสบดี: [

"การงาน มีเกณฑ์เจริญก้าวหน้า แต่ต้องใจเย็นๆ เพราะจะก้าวหน้าแบบช้าๆ" +
" การเงิน รายได้ดีมีเงินเข้ามาเรื่อยๆ" +
" ความรัก คนมีคู่อาจเบื่อกันบ้างบางจังหวะ คนโสดจะมีคนมาจีบแบบเนียนๆ\n\n" +
"สีมงคล : น้ำตาล, แดง\n" +
"เลขนำโชค : ",

"การงาน จะพบที่ปรึกษาที่ดีมาช่วยสร้างผลงาน" +
" การเงิน การเจรจาทางการเงินเกิดข้อตกลงที่ดี" +
" ความรัก อาจตกอยู่ในสถานการณ์รักซ้อน\n\n" +
"สีมงคล : เทา, ดำ \n" +
"เลขนำโชค : 1, 2, 4, 6, 8",

"การงาน เบื่อเรื่องงาน มีเรื่องให้เครียด กำลังใจ ได้ยินข่าวร้าย มีเรื่องให้ท้อแท้" +
" การเงิน การเงินดีมาก แต่ก็เคลียร์หนี้สิน กับภาระค่าใช้จ่าย ยังดีที่หาได้ทัน" +
" ความรัก คอยเอาใจให้กำลังใจ ให้ความสำคัญกับเขาบ้าง นั่นคือสิ่งที่เธอต้องการมากที่สุด\n\n" +
"สีมงคล : ส้ม, แดง\n" +
"เลขนำโชค : 3, 4"
],
วันศุกร์: [

"การงาน ช่วงนี้คุณต้องทำงานหนักเพราะจะไปหวังพึ่งพาคนรอบข้างไม่ได้เลย" +
" การเงิน ช่วงนี้การเงินดีขึ้นกว่าแต่ก่อน" +
" ความรัก คนมีคู่หากมีปัญหาก็จะเริ่มดีขึ้น คนโสดใกล้จะได้เจอคนที่ใช่แล้ว\n\n" +
"สีมงคล : เขียว, บานเย็น\n" +
"เลขนำโชค : 4, 7, 9",

"การงาน ทำการค้าได้ผลกำไรดี" +
" การเงิน พบเรื่องใช้จ่ายช่วยเหลือบริวาร" +
" ความรัก เกิดความสัมพันธ์ที่ดี\n\n" +
"สีมงคล : ส้ม, เขียว\n" +
"เลขนำโชค : 1, 4, 5, 7, 9",

"การงาน ปวดหัว ไมเกรนนอนน้อย เบลอๆคิดอะไรไม่ออก หาอะไรกระตุ้นร่างกายเพื่อวคามสดชื่นหน่อย" +
" การเงิน ได้รับส่วนแบ่งกำไร ได้ผลประโยชน์ เงินคอมมิชชั่น วันนี้เหมาะกับการเสี่ยงโชคมากๆ" +
" ความรัก วางแผนการเดินทาง จองโรงแรมท่องเที่ยว ใช้วันหยุดให้เต็มที่\n\n" +
"สีมงคล : ชมพู, ส้ม\n" +
"เลขนำโชค : 6, 9"
],
วันเสาร์: [

"การงาน มีเกณฑ์ประสบความสำเร็จในหน้าที่การงานอย่างมาก" +
" การเงิน มีโอกาสสมหวังในเรื่องการเงินมากขึ้น" +
" ความรัก คนมีคู่มีเหตุให้ขัดแย้งกันเล็กน้อย คนโสดเรื่องความรักยังดูเงียบๆอยู่\n\n" +
"สีมงคล : ม่วง, ฟ้า\n" +
"เลขนำโชค : 3, 5",

"การงาน ทำธุรกิจเกิดความสำเร็จ" +
" การเงิน จะได้รับโชคอย่างไม่คาดฝัน" +
" ความรัก ความสัมพันธ์อยู่ในเกณฑ์ที่มีความสุขดี\n\n" +
"สีมงคล : บรอนซ์เงิน\n" +
"เลขนำโชค : 1, 3, 5, 6, 9",

"การงาน ดูแลเรื่องสุขภาพ ร่างกายอ่อนเพลีย จะมีผลกระทบกับงาน เช็คอีเมลอ่านไลน์ให้ละเอียด" +
" การเงิน ใช้จ่ายเพลินเลยนะ ซื้อความสุขท่องเที่ยว เมื่อวันกับตัวเองเสียดาย" +
" ความรัก พร้อมหน้าพร้อมตากับครอบครัว ไปคุยกับพ่อแม่ ถ้าโสดไปอยู่กับครอบครัวก็ได้นะขอกำลังใจ\n\n" +
"สีมงคล : ม่วง, ชมพู, ดำ\n" +
"เลขนำโชค : 9, 0"
],
};

/*========================================================================เซียมซี============================================================================*/

const fortunes = {
  วัดพระธาตุดอยสุเทพราชวรวิหาร: [
    {
      "head": "เซียมซีใบที่ ๑",
      "detail": "ใบที่หนึ่งพยากรณ์สุนทรเฉลย\n" + 
      "ด้วยกุศลบุญสร้างปางก่อนเคย\n" +
      "จะน้อมนำให้สเบย และเบิกบาน\n" +
      "ท่านจะมีถิ่นฐานบ้านสำนัก \n" +
      "และยศศักดิ์สิ่งห้อมพร้อมสถาน\n" +
      "ทั้งข้าทาสทรัพย์สินศฤงคาร\n" +
      "ทุกทิวารสุขนี้ไม่มีคลาย\n" +
      "เปรียบเป็นเช่นพญาราชสีห์\n" + 
      "ซึ่งล้วนมีบริวารนั้นมากหลาย\n" +
      "คอยพิทักษ์ล้อมอยู่รอบกาย\n" +
      "จะมิวายสุขซาบอาบทรวงเอยฯ"
    },
    {
      "head": "เซียมซีใบที่ ๒",
      "detail": "ใบที่สองว่าสมอารมณ์คิด\n" +
      "ความในจิตจะสำเร็จเสร็จเหมือนหมาย\n" +
      "จะปราศจากทุกข์สุขเพิ่มเสริมสบาย\n" +
      "ไม่คลาดคลายดังคำพยากรณ์\n" +
      "แต่ช้าหน่อยเช่นเท้าก้าวบันได\n" +
      "ทีละขั้นขึ้นไปไม่หยุดหย่อน\n" +
      "หนทางราบรื่นเรื่อยบทจร\n" +
      "ถึงยอดสุดสโมสรสวัสดี\n" +
      "อันทุกข์โศกโรคภัยจะหายหมด\n" +
      "ดังจันทร์ตรงทรงกลดอร่ามศรี\n" +
      "ถามหาลาภก็สุขสมฤดี\n" +
      "ถามลูกหนี้พี่น้องต้องพบกัน\n" +
      "ถามเนื้อคู่ชู้ร่วมภิรมย์รัก\n" +
      "ว่าดีนักสุขเปรมเกษมสันต์\n" +
      "แต่ช้าหน่อยได้ชมสมใจครัน\n" +
      "จบประพันธ์คำทำนายภิปรายเอยฯ"
    },
    {
      "head":"เซียมซีใบที่ ๓",
      "detail": "ใบที่สามเปรียบเวลาครามืดมิด\n" +
      "เมฆลอยปิดปะปนระคนหมอง\n" +
      "พิรุณโปรยปรายซ่าฟ้าคนอง\n" +
      "สักครู่กลับลำยองพร่างสว่างตา\n" +
      "จะทำการสิ่งใดให้ยั้งคิด\n" +
      "ถ้าตามจิตจักทุกข์เป็นหนักหนา\n" +
      "จงแจ้งเรื่องทุกสิ่งแต่จริงมา\n" +
      "เข้าปรึกษาผู้ใหญ่ให้แนะนำ\n" +
      "นั้นแหละจะสมอารมณ์หวัง\n" +
      "โชคสะพรั่งสิ้นทุกข์เป็นสุขสันต์\n" +
      "ถามหาลูกหนี้พี่น้องพวกพ้องญาติ\n" +
      "ทายไม่พลาดคงพบสบสมาน\n" +
      "ถามเนื้อคู่นั้นเห็นไม่เป็นการ\n" +
      "อย่าริอ่านไม่สมอารมณ์เอยฯ"
    },
    {
      "head":"เซียมซีใบที่ ๔",
      "detail": "ใบที่สี่ความลำบากยากเหลือหลาย\n" +
      "จะตกถิ่นฐานใดให้ขาดแคลน\n" +
      "เฝ้าแต่แค้นเคืองอยู่มิรู้วาย\n" +
      "จะกินนอนร้อนใจไม่เป็นสุข\n" +
      "มีแต่ทุกข์เพิ่มพูนไม่สูญหาย\n" +
      "เหล่าศัตรูแห่ห้อมล้อมรอบกาย\n" +
      "ทายว่าร้ายจงเร่งระวังตัว\n" +
      "ถามหาลาภล้วนยากลำบากล้น\n" +
      "แต่เป็นความนั้นพ้นข้อที่ชั่ว\n" +
      "ถ้าถามพวกลูกหนี้ที่พันพัว\n" +
      "ว่ามืดมัวไม่ประสบได้พบพาน\n" +
      "ถามถึงชู้คู่เคียงจะเรียงพักตร์\n" +
      "อย่าได้ฝักใฝ่เห็นเป็นแก่นสาร\n" +
      "มีแต่ร้ายร้อนใจให้รำคาญ\n" +
      "สงบการยั้งสติ ตริรองเอยฯ"
    },
    {
      "head":"เซียมซีใบที่ ๕",
      "detail": "ใบที่ห้านี้แถลงแจ้งสุนทร\n" +
      "ในคำกลอนบอกความที่ถามไถ่\n" +
      "ถามหาลาภนั้นเป็นไม่เป็นไร\n" +
      "คงจะได้สมความตามยินดี\n" +
      "ถามเนื้อคู่ชู้สมสมสวาท\n" +
      "ว่ายังคลาดเหินห่างทางวิถี\n" +
      "ดังเรือน้อยลอยคว้างกลางนที\n" +
      "มองเห็นท่าที่จอดอยู่ไกลตา\n" +
      "ต้องเนิ่นหน่อยลอยลำแล่นละล่อง\n" +
      "แต่ไม่ต้องพายเหนื่อยเมื่อยนักหนา\n" +
      "กระแสชนจะอำนวยช่วยพัดพา\n" +
      "ให้ถึงท่าสมสุขสำราญกาย\n" +
      "ถามโชคลาภคงได้ดังใจนึก\n" +
      "ถามถึงศึกสู้ความไม่ขามหลาย\n" +
      "ต้องชนะจริงจังดังภิปราย\n" +
      "ถามคนเจ็บว่าสบายหายแน่นอน\n" +
      "ถ้าถามถึงคนหลี้หลบหนีหน้า\n" +
      "ขอทายว่ายังไม่พบประสบก่อน\n" +
      "ถามบุตรสุดที่รักในอุทร ดังสุนทรคำทายว่าชายเอยฯ"
    },
      
  ],
  วัดพระธาตุพนม: [
    {
      "head": "เซียมซีใบที่ ๑",
      "detail": "ใบปฐมสมจิตอธิษฐาน\n" +
      "จะมีผู้อุปถัมภ์แสนสำราญ\n" +
      "สำเร็จการที่ตรึกนึกในใจ\n" +
      "แต่ช้า ๆ จึงจะสมอารมณ์คิด\n" +
      "ด้วยเดชสัตย์สุจริตประสิทธิ์ให้\n" +
      "ทั้งพวกพ้องวงศ์ญาติปราศทุกข์ภัย\n" +
      "มีโชคชัยได้สุขทุกคืนวัน\n" +
      "แม้นถามถึงโชคร้ายในกายตัว\n" +
      "อีกสักหน่อยค่อยยังชั่วอย่าโกศัลย์\n" +
      "ถามลูกหนี้พี่น้องต้องพบกัน\n" +
      "ไม่ช้าวันพบพักตร์เหมือนทักทาย\n" +
      "ลาภพิเศษเจตนาเวลานี้\n" +
      "นาน ๆ มีให้บ้างไม่ห่างหาย\n" +
      "ถามเนื้อคู่ดูดีจริงทั้งหญิงชาย\n" +
      "เหมือนชักนำทำนายเท่านี้เอย ฯ"
    },
    {
      "head": "เซียมซีใบที่ ๒",
      "detail": "ใบที่สองต้องกันเหมือนจันทร์ฉาย\n" +
      "เปรียบเหมือนต้นพฤกษาเวลาตาย\n" +
      "ต้องสาดสายน้ำค้างในกลางคืน\n" +
      "บริสุทธิ์สดชื่นทุกสิ่งสรรพ์\n" +
      "จะทำการสิ่งใดพร้อมใจกัน\n" +
      "ไม่นานวันคงสมอารมณ์หมาย\n" +
      "ไปข้างหน้าว่าดีพาทีทาย\n" +
      "คิดแยกย้ายแปรสถานไปไม่สู้ดี\n" +
      "อยู่กับที่จะมีลาภอเนกหลาย\n" +
      "ถามถึงคนป่วยไข้ว่าได้คลาย\n" +
      "ถามถึงพวกพ้องพี่น้องต้องพบตรง\n" +
      "ทั้งลูกหนี้ที่หนีหน้าจะมาสู่\n" +
      "แต่เนื้อคู่มิได้ชมสมประสงค์\n" +
      "ลาภอย่างอื่นทายตรงว่าดีเท่านี้เอย ฯ"
    },
    {
    "head":"เซียมซีใบที่ ๓",
    "detail":"ใบที่สามคามยากลำบากลัน\n" +
    "จะทำการก็ป่วยการรำคาญตน\n" +
    "ว่ามีคนปองร้ายไม่วายวัน\n" +
    "ถึงกินอิ่มนอนหลับก็กลับทุกข์\n" +
    "ไม่มีสุขสักเวลาแทบอาสัญ\n" +
    "แต่ถามเรื่องเป็นความไม่คร้ามกัน\n" +
    "คงผ่อนผันสู้ได้เป็นไรมี\n" +
    "จะไปห้าผู้ใดก็ไม่ยาก\n" +
    "ถามลูกหนี้ที่จากพลัดพรากหนี\n" +
    "ว่ายังไม่พบกันในทันที\n" +
    "หาลาภนี้ก็ยากลำบากกาย\n" +
    "ถามเรื่องคู่สู่สมภิรมย์พักตร์\n" +
    "ว่าร้ายนักฟั่นเฟือนไม่เหมือนหมาย\n" +
    "จงสงบไว้ก่อนผ่อนพักกาย\n" +
    "หมดคำทำนายที่สามจบความเอย ฯ"
    },
    {
    "head":"เซียมซีใบที่ ๔",
    "detail":"ใบที่สี่นี้ไซร้เหมือนไกลคู่\n" +
    "มิได้รู้ยามพบประสบสอง\n" +
    "เหมือนลูกไก่ฝูงเดียวเที่ยวคะนอง\n" +
    "ตัวหนึ่งต้องจากไปเสียไกลกัน\n" +
    "ต่อนานจึงจะพบประสบพักตร์\n" +
    "ได้ร่วมรักปรีดิ์เปรมเกษมสันต์\n" +
    "จะทำการสิ่งใดพร้อมใจกัน\n" +
    "แต่ข้อนั้นทายไว้ในนี้ว่า\n" +
    "อย่าดำเนินเดินหน้าท่านว่าร้าย\n" +
    "เราต้องหมายตามหลังระวังหนี\n" +
    "เหมือนพระจันทร์ร่อนเร่ในเมมี\n" +
    "อาทิตย์หนีอัสดงรีบลงดิน\n" +
    "ถามคนเจ็บว่าหายสบายใจ\n" +
    "ถามโชคชัยในคดีที่ตัดสิน\n" +
    "คงชนะเด็ดขาดปราศมลทิน\n" +
    "ได้ยลยินแต่สิ่งให้ใจสบาย\n" +
    "อันความหวังตั้งไว้ไม่นานนัก\n" +
    "ถามลูกรักในครรภ์เหมือนมั่นหมาย\n" +
    "ว่าคงจะรู้เห็นได้เป็นชายจบทำนายใบที่สี่เท่านี้เอย ฯ"
    },
    {
    "head":"เซียมซีใบที่ ๕",
    "detail": "ใบที่ห้าว่าไว้ในอักษร ไม่ม่ใครทำร้ายให้จากจร\n" +
    "อย่าทุกร์ร้อนไปเลยไม่เคยการ\n" +
    "ถ้าแม้นรักมักได้ควายชองเขา\n" +
    "ม้าของเราจะต้องพรากจากสถาน\n" +
    "อุปมาของเก่าเค้าบุราณ\n" +
    "ดูอาการคนคบประจบแจง\n" +
    "แม้ถามหาเนื้อคู่ว่าอยู่ไกล\n" +
    "ยังไม่ได้เหมือนจิตเร่งคิดแหนง\n" +
    "ถามลูกหนี้หนีไม่ชี้แจง\n" +
    "เสาะแสวงยากจะพบประสบกัน\n" +
    "ถามหาลาภนี้ไซร้ก็ได้ยาก\n" +
    "ต้องลำบากทุกข์ร้อนจงผ่อนผัน\n" +
    "แม้นถามบุตรสุดใจที่ในครรภ์\n" +
    "เลขห้านั้นว่าหญิงแท้จริงเอย ฯ"
    },
  ],
  วัดมังกรกมลาวาส: [
    {
      "head":"เซียมซีใบที่ ๑",
      "detail":"所 求 俤三 第 \n" +
      "求 名 母 聖 一 \n" +
      "萬 登 降 通 聖 \n" +
      "事 科凡 大 聖 \n" +
      "全 甲間 道 吉 \n\n" +
      "สิ่งที่ท่านขอจะสมความปรารถนา\n" +
      "ท่านจะได้ชื่อเสียงเกียรติยศ\n" +
      "การงานเจริญรุ่งเรืองสรรพสิ่ง\n" +
      "สมประสงค์ดีนักแล"
    },
    {
      "head":"เซียมซีใบที่ ๒",
      "detail": " 天 但 所 中 第 \n" +
      "閒 看 作 陽 二 \n" +
      "月中事 兩 諹 \n" +
      "再 秋 無 頴 聖 \n" +
      "明 月 定聖 平 \n\n" +
      "ท่านจะทำงานสิ่งใดให้มีความมั่นใจในงานนั้น\n" +
      "และควรมีจิตใจอันมั่นคงก่อนกาลเวลามาถึง\n" +
      "สิ่งต่าง ๆ ก็จะสมดังปรารถนาเอย"
    },
    {
      "head":"เซียมซีใบที่ ๓",
      "detail": " 守 忍 求 心 第 \n" +
      "份 耐 謀 思 三 \n " +
      "免 方 未 多 簽 \n " +
      "災 為 得 不 \n" +
      "星 福 成 定 \n\n" +
      "จิตใจของท่านไม่แน่นอน\n" +
      "จะขอพรอะไรก็ไม่สมดังปรารถนา\n" +
      "ต้องมีจิตใจอันมั่นคงก่อน\n" +
      "ถึงเวลาสรรพสิ่งต่าง ๆ จะดีขึ้น"
    },
    {
      "head":"เซียมซีใบที่ ๔",
      "detail":"走 求 萬 日第 \n " +
      "試 官 事 出 四 \n" +
      "狀 皆 大 在 聖 \n" +
      "元 進 吉 東 陰 \n" +
      "郎 爵 昌 方 吉 \n\n" +
      "ดวงชะตาของท่านเปรียบเหมือน\n" +
      "แสงอาทิตย์อันแรงกล้า\n" +
      "สรรพสิ่งต่าง ๆ จะได้สมประสงค์\n" +
      "จะมีลาภยศพบเนื้อคู่ผู้มีบุญดีนักแล"
    },
    {
      "head":"เซียมซีใบที่ ๕",
      "detail": "勞 泥 空 二 弟 \n" +
      "碌 龍 山 聖 五 \n" +
      "抂 何 無 下 聖聖 \n" +
      "虛 作 寶一 陽 \n" +
      "行 雨 藏 陽 平 \n\n" +
      "บุญที่เคยทำมานั้นน้อยมาก\n" +
      "เปรียบเหมือนภูเขาหินอันไร้ค่า\n" +
      "โชคลาภยังไม่มีช่วงนี้\n" +
      "จงหมั่นสร้างบุญกุศลไว้ให้มากภายภาคหน้า\n" +
      "ครอบครัวและตัวท่านจะอยู่ร่มเย็นเป็นสุข"
    },
  ],
  วัดสุทัศนเทพวรารามราชวรมหาวิหาร: [
    {
      "head":"เซียมซีใบที่ ๑",
      "detail":"ใบที่หนึ่งสมมาตรปรารถนาทายไว้ว่า\n" +
      "มีคนชุบอุปถัมภ์หมายสิ่งใดในจิต\n" +
      "คิดว่าจะทำ ว่าคงสำเร็จการประมาณมี\n" +
      "แต่ช้าช้าจึงจะสมอารมณ์ปอง\n" +
      "ทั้งพวกพ้องปรีดิ์เปรมเกษมศรี\n" +
      "ว่าอยู่เย็นเป็นสุขทุกเดือนปี\n" +
      "แม้นใบนี้ถามโรคที่โศกกาย\n" +
      "ว่าคงหายเบาบางเหมือนอย่างทายกัน\n" +
      "หรือถามหาลูกหนี้พี่น้องหาย\n" +
      "ว่าคงจะพบพักตร์เหมือนทักทาย\n" +
      "หรือถามหมายหาลาภไม่หยาบคำ\n" +
      "ว่าช้าช้าคงสมอารมณ์นึก\n" +
      "ได้ก้องกึกเหล่ากอเป็นข้อขำ\n" +
      "ถามหาคู่ดีนักเหมือนชักนำ\n" +
      "ขอจบคำที่หนึ่งรำพึงเอยฯ "
    },
    {
      "head":"เซียมซีใบที่ ๒",
      "detail":"ใบที่สองต้องกันเหมือนจันทร์ฉาย\n" +
      "เปรียบกับต้นพฤกษาคราที่ตาย\n" +
      "แล้วกลับกลายได้เป็นเหมือนเช่นเดิม\n" +
      "ได้ผลิดอกออกใบไสวสว่าง\n" +
      "ต้องน้ำค้างลมเชยรำเพยเสริม\n" +
      "เหมือนกระจกบานเก่าเมื่อคราวเดิม\n" +
      "ต้องเพิ่มเติมขัดถูจึงดูงาม\n" +
      "จะทำการสิ่งใดพร้อมใจกัน\n" +
      "จงผ่อนผันหารือนับถือถาม\n" +
      "คงสมจิตสมปองทำนองความ\n" +
      "ใบนี้ถามคนไข้ว่าได้คลาย\n" +
      "ถามลูกหนี้พวกพ้องว่าต้องพบ\n" +
      "ถามเรื่องคู่รู้จบไม่สมหมาย\n" +
      "ถามหาลาภว่าดีพาทีทาย\n" +
      "จบภิปรายเลขสองทำนองเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๓",
      "detail":"ใบที่สามความว่าไม่ผาสุก\n" +
      "จะได้ทุกข์ร้อนใจดังไฟผลาญ\n" +
      "ประกอบกิจจิตขุ่นวุ่นรำคาญ\n" +
      "กลับป่วยการโทษระคนผลไม่มี\n" +
      "จะกินนอนไม่อิ่มหนำแสนลำบาก\n" +
      "ถึงคราวยากยามระเหี่ยต้องเสียศรี\n" +
      "ปัจจามิตรคิดร้ายไม่มีดี\n" +
      "ดวงชีวีทุกข์นักแทบจักวาย\n" +
      "แต่ถ้าถามความคดีที่ต่อสู้\n" +
      "คงเชิดชูมีชัยไม่แพ้หลาย\n" +
      "จะเข้าหาผู้ใดก็ง่ายดาย\n" +
      "ลูกหนี้หายทายว่ายังไม่พบกัน\n" +
      "ถามหาลาภยากนักจักเฉลย\n" +
      "คู่เขนยยังรวนเรคิดเหหัน\n" +
      "จงสงบกายใจให้ดีครัน\n" +
      "สู้ผ่อนผันตามวจีที่สามเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๔",
      "detail":"ใบที่สี่ชี้ชัดความพลัดพราก\n" +
      "เหมือนต้องจากคู่ไปไกลสถาน\n" +
      "ดังลูกไก่พลัดวงหลงไปนาน\n" +
      "กว่าจะพานพบหน้าก็ช้าจังn\n" +
      "ต้องอุตสาห์อดกลั้นถึงนานหน่อย\n" +
      "แล้วจึงค่อยเป็นสุขในยุคหลัง\n" +
      "จงประคองตนไว้อย่าให้พลั้ง\n" +
      "ดวงจิตตั้งหวังสมานสามัคคี\n" +
      "เร่งนอบนบเคารพอยู่ที่ผู้ใหญ่\n" +
      "คอยตามไปใช้พินิจกิจวิถี\n" +
      "เหมือนดวงจันทร์ส่องฟ้าในราตรี\n" +
      "เมื่อแสงศรีสุริยันตะวันรอน\n" +
      "ถามถึงไข้ว่าคงหายได้สำราญ\n" +
      "ความโรงศาลมีชัยไม่หลอกหลอน\n" +
      "ยังไม่พบลูกหนี้ที่หนีจร\n" +
      "ในอุทรบุตรเป็นชายคำทายเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๕",
      "detail":"ใบที่ห้าว่าไว้ให้เห็นชัด\n" +
      "อย่าอึดอัดอกใจไปเลยหนอ\n" +
      "ไม่ควรคิดเกินเขตเหตุไม่พอ\n" +
      "ไม่มีข้อคิดร้ายในตัวใคร\n" +
      "การทุกข์ใจไปเปล่าไม่เข้าการ\n" +
      "ถือโบราณทำนองจะผ่องใส\n" +
      "จะคบคนดูหน้าอย่าเบาใจ\n" +
      "อย่าโลภมากอยากได้ของเขามา\n" +
      "แม้นถามหาเนื้อคู่อยู่ไกลครัน\n" +
      "ยังไม่ได้สมหวังจงยั้งคิด\n" +
      "จะตามติดลูกหนี้ที่ผายผัน\n" +
      "ทายว่าจะไม่พบประสบกัน\n" +
      "ส่วนลาภนั้นได้ยากลำบากจริง\n" +
      "กว่าจะได้ก็เห็นลำเค็ญสุด\n" +
      "ส่วนว่าบุตรในครรภ์นั้นเป็นหญิง\n" +
      "เร่งเชื่อกรรมทำดีเป็นที่อิง\n" +
      "ประกอบกิจสุจริตยิ่งเป็นนิตย์เอยฯ"
    },
  ],
  ศาลหลักเมืองกรุงเทพ: [
    {
      "head":"เซียมซีใบที่ ๑",
      "detail":"ใบที่หนึ่งดีนักประจักจิต ในลิขิตบอก\n" +
      "แจ้งแห่งนุสนธิ์ จงสมหวังดังที่มีกังวล\n" +
      "หาลาภผลก็ได้ดังใจหมาย\n" +
      "ถ้าหญิงชายหาคู่ที่ชูชิด\n" +
      "ต้องสมคิดมั่นคงอย่าสงสัย\n" +
      "ถามหาลาภลาภก็มีดีกระไร\n" +
      "ถามถึงไข้ก็เบาบรรเทาลง\n" +
      "ถามถึงที่พึ่งก็หนึ่งแน่\n" +
      "ไม่ปรวนแปรเหลวเลือนให้เชือนหลง\n" +
      "ถามถึงบุตรในครรภ์นั้นมั่นคง\n" +
      "เป็นชายยงแน่แล้วไม่แคล้วเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๒",
      "detail":"ใบที่สองปองหาถ้าลําบาก\n" +
      "เหมือนนกจากรังบินขึ้นเวหา\n" +
      "ต้องแดดเผาเศร้าอารมณ์ระทมอุรา\n" +
      "หาเลี้ยงตนแต่พอปากลําบากกาย\n" +
      "ต้องรอใจไว้ท่าช้า ๆ ก่อน\n" +
      "จึงจะผ่อนให้เบาบรรเทาหาย\n" +
      "ฤดูนี้มีแต่ไม่ใคร่สบาย\n" +
      "ยิ่งขวนขวายยิ่งช้ำแสนรําคาญ\n" +
      "เปรียบพฤกษาหน้าแล้งไม่มีฝน\n" +
      "ทั้งดอกผลก็ไม่สดรสก็ไม่หวาน\n" +
      "ถามความจริงใดไม่ได้การต่อนาน ๆ ปลายปีจึงดีเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๓",
      "detail":"ใบที่สามตามตําราทายว่าเห็น\n" +
      "ถ้าหวังเป็นลาภยศต้องขวนขวาย\n" +
      "จึงจะสมอารมณ์มาตรไม่คลาดคลาย\n" +
      "ลําบากกายสักหน่อยหนึ่งจึงจะดี\n" +
      "เป็นแน่ใจในตําราไม่ช้านัก\n" +
      "เช่นไม้ปักบนเนินไม่เดินหนี\n" +
      "ถามถึงลาภที่หาถ้าจะมี\n" +
      "ถามถึงคนที่ปองยังสองใจ\n" +
      "ถามถึงคู่ชู้เช่นคําที่ว่า\n" +
      "จะมีมามั่งคงไม่สงสัย\n" +
      "แต่เดือนนี้ลําบากแสนยากใจ\n" +
      "ต้องรอไปสักนิดสมคิดเอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๔",
      "detail":"ใบที่สี่ตําราทายว่ายาก\n" +
      "ต้องพลัดพรากนานพบประสพสม\n" +
      "เช่นว่าวน้อยขาดลอยไปตามลม\n" +
      "ใครนิยมไม่ได้สมใจหมาย\n" +
      "ตําราทายว่าพายเรือทวนน้ำ\n" +
      "ยิ่งลอยลํายังไกลไปไม่ได้\n" +
      "ถ้าคลาดแคล้วแจวกระหน่ำไป\n" +
      "ก็เหนื่อยใจเจียน ชีวาตจะขาดรอน\n" +
      "เหตุสําคัญท่านว่าเวลานี้พระฤษี\n" +
      "พบศพพราหมณ์เกษร\n" +
      "ควรหยุดยั้งฟังกระแสให้แน่นอนช้า ๆ\n" +
      "ก่อนเถิดคงจะสมอารมณ์เอย ฯ"
    },
    {
      "head":"เซียมซีใบที่ ๕",
      "detail":"ใบที่ห้าว่าไว้ในอักษร\n" +
      "ไม่มีใครทําร้ายขจายจร\n" +
      "อย่าทุกข์ร้อนไปเลยไม่เคยการ\n" +
      "ถ้าแม้นรักมักได้ควายของเขา\n" +
      "ม้าของเราจะต้องพรากจากสถาน\n" +
      "ถ้าจะคบคนผู้ให้ดูการ\n" +
      "ถือโบราณแบบเก่าค่อยเบาความ\n" +
      "แม้นถามหาเนื้อคู่ว่าอยู่ไกล\n" +
      "ยังไม่ได้ เหมือนจิตที่คิดหมาย\n" +
      "ถามลูกหนี้หนีไปในใจความ\n" +
      "จะติดตามไม่พบประสพกัน\n" +
      "ถามหาลาภนี้ไซร้ก็ได้ยาก\n" +
      "ต้องลําบากทุกข์ร้อนจงผ่อนผัน\n" +
      "แม้นถามบุตรสุดใจที่ในครรภ์\n" +
      "เลข ๕ นั้นว่าหญิงทุกสิ่งเอย ฯ"
    },
  ],
  วัดหลวงพ่อโสธร: [
    {
      "head":"เซียมซีใบที่ ๑",
      "detail":"ใบปฐม สมหวัง ดังตั้งจิต\n" +
      "จะมีมิตร อุปถัมภ์ สำราญยิ่ง\n" +
      "งานที่ตรึก นึกในใจ สำเร็จจริง\n" +
      "แต่ทุกสิ่ง ต้องช้าๆ พร้าเล่มงาม\n" +
      "ด้วยเดชแห่ง ความจริง อิงคำสัตย์\n" +
      "ภัยพิบัติ ปราศป้อง ไม่ต้องขาม\n" +
      "มีโชคชัย สมสุข ทุกโมงยาม\n" +
      "ญาติติดตาม และพวกพร้อง ก็ต้องกัน\n" +
      "หากถามถึง โรคภัย ในกายท่าน\n" +
      "ไม่นานวัน ค่อยยังชั่ว อย่าโศกศัลย์\n" +
      "ถามพี่น้อง เจ้าของหนี้ ที่ค้างกัน\n" +
      "ไม่นานวัน จะเห็นหน้า มาทักทาย\n" +
      "เจตนา ถามหาลาภ ก็ทราบแน่\n" +
      "อย่าท้อแท้ นานๆ ไม่หนีหาย\n" +
      "ถามเนื้อคู่ ดูเหมาะสม คำทำนาย\n" +
      "ความสุดท้าย ท่านจงสุข ทุกเวลาฯ"
    },
    {
      "head":"เซียมซีใบที่ ๒",
      "detail":"ใบที่สอง ต้องมาคู่ จึงอยู่ได้\n" +
      "ดังต้นไม้ อาศัยน้ำ ยามเหี่ยวเฉา\n" +
      "บริสุทธิ์ สดชื่น คืนร่มเงา\n" +
      "ดังคนเรา ต้องอาศัย น้ำใจกัน\n" +
      "จะทำการ สิ่งใด ให้พร้อมพรรค\n" +
      "ไม่นานนัก จะสมหวัง นั่งสุขสันต์\n" +
      "ไปข้างหน้า ว่าดี เป็นนิรันดร์\n" +
      "แยกสถาน ถิ่นอาศัย ไม่ดีเลย\n" +
      "อยู่กับที่ จะมีลาภ มิใช่น้อย\n" +
      "ความไข้พลอย เหือดหาย ได้เฉลย\n" +
      "ถามพี่น้อง ต้องพบกัน ดังเช่นเคย\n" +
      "ลูกหนี้เอา เคยหนีหน้า จะมาเยือน\n" +
      "ถามเนื้อคู่ ร่วมชีวิต ผิดประสงค์\n" +
      "ลาภอย่างอื่น คงได้ตรง เสมอเหมือน\n" +
      "คำทำนาย ท้ายสุด อย่าแชร์เชือน\n" +
      "ทำความเพียร สร้างบุญไว้ ได้ดีเอยฯ"
    },
    {
      "head":"เซียมซีใบที่ ๓",
      "detail":"ใบที่สาม ถามความ ว่าลำบาก\n" +
      "ทำการยาก เพราะตน วนผกผัน\n" +
      "เพราะมีคน ปองร้าย ไม่วายวัน\n" +
      "กินนอนนั้น ถึงอิ่มแท้ แต่ทุกข์ตรม\n" +
      "ไม่มีสุข สักเวลา แทบอาสัญ\n" +
      "เป็นความกัน พอสู้ไหว ไม่ขื่นขม\n" +
      "จะไปหา ผู้ใด สมอารมณ์\n" +
      "นำคำคม สู้คดี ไม่มีความ\n" +
      "ถามลูกหนี้ ที่จากไกล ไม่เห็นหน้า\n" +
      "ทันทีว่า ยังไม่พบ ลบคำถาม\n" +
      "ทั้งลาภยศ ก็ลำบาก ยากติดตาม\n" +
      "ไม่สมความ ปรารถนา สักคราเอย\n" +
      "ถามถึงคู่ สู่สม ภิรมย์รัก\n" +
      "ว่าร้ายนัก ฟั่นเฟือน เหมือนคำเอ่ย\n" +
      "จงสงบ จิตใจ ไว้ก่อนเอย\n" +
      "จบคำพังเพย ใบที่สม ตามกล่าวมาฯ"
    },
    {
      "head":"เซียมซีใบที่ ๔",
      "detail":"เหมือนไกลคู่ อยู่ใน ใบที่สี่\n" +
      "คงนานปี กว่าจะพบ ประสบสอง\n" +
      "ต้องโดดเดี่ยว เที่ยวตรึก คึกคะนอง\n" +
      "เพราะเนื้อทอง วันวัย ยังไกลกัน\n" +
      "ยังอีกนาน กว่าพานพบ ประสบพักตร์\n" +
      "กับคู่รัก ปรีเปรม เกษมสันต์\n" +
      "ถ้าทำงาน ทั้งสองต้อง พร้อมใจกัน\n" +
      "ไม่อย่างนั้น ที่ทายไว้ ไม่ดีเอย\n" +
      "หากใครเดิน นำหน้า ท่านว่าร้าย\n" +
      "บอกความหมาย ให้ตามหลัง ฟังเฉลย\n" +
      "เพราะจะหนี หน้าไป ไม่ฟังเลย\n" +
      "ถ้าเปรียบเปรย ดุจจันทร์เจ้า เข้าเมฆี\n" +
      "ถามคนเจ็บ ว่าหาย ไม่ต้องห่วง\n" +
      "โชคลุล่วง ด้านไหน ไม่หน่ายหนี\n" +
      "ชนะขาด ปราชญ์ป้อง รับรองดี\n" +
      "ท่านจะมี สุขใจ เมื่อได้ยิน\n" +
      "สิ่งที่หวัง ตั้งไว้ คงไม่ช้า\n" +
      "หากถามหา ลูกในครรภ์ สมถวิล\n" +
      "ว่าเป็นชาย ให้ท่าน ได้สมจินต์\n" +
      "อนุทิน ใบที่สี่ เท่านี้เอยฯ"
    },
    {
      "head":"เซียมซีใบที่ ๕",
      "detail":"ใบที่ห้า ความมี ที่ว่าไว้\n" +
      "ไม่มีใคร จะทำร้าย ให้ทุกข์ร้อน\n" +
      "อย่ากังวล คนทำร้าย ให้จากจร\n" +
      "เพราะอักษร เสนอมา ว่าไร้พาล\n" +
      "ถามหารัก มักต้องมี ของแลกเปลี่ยน\n" +
      "ควายมาเยือน ม้าเราพราก จากสถาน\n" +
      "ดังอดีต ที่มีมา แต่ช้านาน\n" +
      "เพราะอาการ คนที่คบ ประจบประแจง\n" +
      "เรื่องเนื้อคู่ ยังอยู่ไกล กว่าได้พบ\n" +
      "ไม่ประสบ สมใจ คิดหน่ายแหนง\n" +
      "ถามลูกหนี้ ยังหนีไกล ไม่แสดง\n" +
      "ดังฟ้าแกล้ง ไม่ให้พบ ประสบกัน\n" +
      "ถามหาลาภ ทราบไว้ ไม่ง่ายนัก\n" +
      "ยังลำบาก ทุกข์ร้อน ไม่ผ่อนผัน\n" +
      "ถามถึงบุตร สุดดวงใจ ที่ในครรภ์\n" +
      "หญิงเท่านั้น ใบที่ห้า ว่าสมปองฯ"
    },
  ],
};

/*============================================================================สุ่มไพ่ทาโร่========================================================================*/

const tarotCards = {
  ความรัก: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ไพ่ใบนี้ในทางที่ดีคือ มีอิสระที่จะคิด มีอิสระที่จะรัก คนที่ได้ไพ่ประจำตัวใบนี้ จึงเป็นคนที่มองโลกในแง่ดี พร้อมที่จะเผชิญปัญหาที่อาจจะหนักหน่วง เพื่อสิ่งที่ตนรัก โดยไม่สนใจสิ่งที่จะตามมาเท่าไหร่\n" +
  "ถ้าถามในเรื่องความรักความสัมพันธ์ ก็จะหมายความว่า เป็นความรักที่ตัวเราพร้อมที่จะรัก โดยที่ไม่สนใจว่าข้างหน้า เราจะเจ็บ หรือมีผลลัพธ์ที่ไม่ดี เราก็ยังเดินหน้าที่จะรักต่อไป\n" +
  "แต่ถ้าถามในด้านความรู้สึกของอีกฝ่าย ก็ต้องดูบริบทของความสัมพันธ์ เช่น ถ้ามีคนมารักมาชอบเรา แล้วเค้าเป็นคนแบบในไพ่ใบนี้ ก็อาจหมายถึงเค้าชอบเรา และพร้อมจะรักหรือชอบเรา แม้จะมีอุปสรรคหรือแม้เราจะมีคนอื่นอยู่แล้ว หรือ ถ้าเราไปรักไปชอบใคร แต่ไพ่ใบนี้ออกตำแหน่งทีบ่งบอกถึงเค้า ก็อาจหมายความว่า เค้ายังไม่คิดจะมีใคร ยังอยากผจญภัยในโลกกว้าง ยังมองหาคนอื่นอยู่นั่นเอง",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"ไพ่ใบนี้ถ้ามองในมุมมองความสัมพันธ์ หมายถึงความรัก ความสัมพันธ์ที่ราบรื่น จัดการทุกอย่างได้ดูดีไปหมด ทั้งด้านอารมณ์และความคิด มีความสามารถในการแก้ปัญหาต่างๆ หากมีความไม่เข้าใจกันก็จะทำการปรับความเข้าใจกันได้เป็นอย่างดี\n" +
  "แต่ถ้าเป็นตัวบุคคล จอมเวทย์คนนี้ก็มีข้อเสีย เพราะคนๆนี้ที่ได้ไพ่ใบนี้เป็นตัวแทนนั้น จะมีลักษณะฉลาด เหมือนจะเข้าใจทุกอย่างไปทั้งหมด มีความเจ้าเล่ห์เพทุบาย โดยในความสัมพันธ์นั้นเค้าอาจจะใช้ Trick หรือ วิธีในความสัมพันธ์ที่อาจจะไม่ซื่อซักหน่อย แต่ก็ไม่ถึงกับเป็นสิ่งไม่ดี เช่น ถ้ามาจีบก็อาจจะมีการหายไปให้เราคิดถึงบ้าง หรือมีการวางแผนการต่างๆมาแล้ว",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"ไพ่ใบนี้ให้ความหมายในด้านความรักค่อนข้างดี เป็นความรักที่สมบูรณ์ ราบรื่น มีความใส่ใจดูแล\n" +
  "โดยเฉพาะถ้าเป็นไพ่แทนตัวผู้หญิงด้วยแล้ว มันหมายถึงว่า อีกฝ่ายนั้นมอบทั้งใจและกายให้คุณจนหมด โดยที่คุณไม่ต้องไปบังคับควบคุมอะไร\n" +
  "ในกรณีที่ผู้ชายถามถึงว่าผู้หญิงคนนี้คิดยังไงกับตน แล้วได้ไพ่ใบนี้โผล่ขึ้นมา ต้องบอกว่าเธอรักและพร้อมดูแลคุณ เพราะเธอมีลักษณะความเป็นแม่สูง เธอก็จะดูแลคุณอย่างดี มีความหวังดีให้คุณอย่างจริงใจ แต่รักในฐานะอะไรนั้นก็ดูออกได้ยากอยู่เหมือนกัน",
  },
  ],

  การเงิน: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ความหมายของไพ่ใบนี้คือใช้เงินเก่ง หาได้เท่าไหร่ก็ใช้หมด โดยมักจะหมดไปกับของที่รักที่ชอบแม้จะไม่ใช่สิ่งที่จำเป็น ไม่ค่อยวางแผนทางการเงิน แต่อีกความหมายหนึ่งคือมักจะมีโชคจากผู้หญิงสนับสนุนทางการเงินอยู่บ้าง",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"เป็นคนหาเงินเก่ง แต่ก็ใช้เงินเก่งเช่นกัน",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"ไพ่ใบนี้บอกถึงการเงินที่สมบูรณ์ หมายความว่าจะมีการเงินที่ดี ไม่ขัดสน หรืออาจมีผู้อุปถัมภ์เรื่องเงินที่เป็นผู้หญิง",
  }
  ],

  การงาน: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ความหมายของไพ่ใบนี้บอกว่าช่วงนี้คุณจะไม่มีความมุ่งมั่น เรื่อยๆ เฉี่อยๆ ขี้เกียจ ไม่ใส่ใจ ไม่จริงจัง หรือมีเรื่องอื่นที่สนใจมากกว่า ให้โฟกัสกับงานมากขึ้น",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"เป็นคนเก่ง คนฉลาด สามารถผ่านอุปสรรคได้โดยง่าย เรียนรู้เร็ว ทำงานดี พรีเซ็นตัวเองเก่ง นำเสนอเก่ง ให้ใช้ทักษะที่มีแล้วทุกอย่างจะดี",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"ถ้ามีความตั้งใจ คนที่ได้ไพ่ใบนี้มักจะทำได้ดีและโดดเด่นมากในเรื่องการงาน พบความสำเร็จทางความรู้ความสามารถและอำนาจ",
  }
  ],

  โชคลาภ: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ไพ่ใบนี้สื่อถึงโอกาสใหม่ ๆ ที่ไม่คาดคิด  อาจจะได้รับเงินก้อนใหญ่แบบฟลุ๊ค ๆ หรือมีโชคลาภจากการเสี่ยงโชค  อย่างไรก็ตาม  ไพ่ใบนี้ยังเตือนให้ระวังการใช้จ่ายอย่างประมาท  และควรมีสติไตร่ตรองก่อนตัดสินใจลงทุนใด ๆ",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"ไพ่ใบนี้สื่อถึงความสามารถและทักษะของคุณที่จะนำมาต่อยอดทางการเงิน  คุณมีความคิดสร้างสรรค์และมี่โอกาสประสบความสำเร็จในธุรกิจ  อาจจะมีรายได้เสริมจากงานอดิเรก  หรือได้รับผลตอบแทนจากการลงทุน",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"ไพ่ใบนี้สื่อถึงความมั่งคั่ง  ความอุดมสมบูรณ์  และความสำเร็จทางการเงิน  คุณจะมีโอกาสได้รับเงินก้อนโต  ธุรกิจของคุณจะรุ่งเรือง  มีความเป็นไปได้ที่จะได้รับมรดก  หรือรางวัลจากการทำงานหนัก",
  }
  ],

  การเรียน: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ในช่วงนี้คุณอาจจะไม่มีความมุ่งมั่น เรื่อยๆ เฉี่อยๆ ขี้เกียจ ไม่ใส่ใจ ไม่จริงจัง หรือมีเรื่องอื่นที่สนใจมากกว่า ทำให้หลุดโฟกัส ควรโฟกัสกับสิ่งที่อยู่ตรงหน้าก่อนแล้วทุกอย่างจะดี",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"โดยปกติคุณเป็นคนเก่ง คนฉลาด สามารถผ่านอุปสรรคได้โดยง่าย เรียนรู้เร็ว ทำงานดี พรีเซ็นตัวเองเก่ง นำเสนอเก่ง ทำให้ทุกอย่างเป็นไปได้ด้วยดี เพราะทักษะของคุณที่ใช้มันอย่างถูกต้อง",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"การเรียนดี มีการศึกษาดี คนที่มีไพ่ใบนี้เป็นไพ่ประจำตัวมักจะเรียนได้ดี",
  }
  ],

  สุขภาพ: [
  {
  "head":"The Fool",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_0.png",
  "detail":"ทำนายได้ถึงปัญหาช่วงขา หัวเข่า ข้อเท้า เท้า",
  },
  {
  "head":"The Magician",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_1.png",
  "detail":"ไพ่ใบนี้ทำนายได้ถึงมีปัญหาโรคภูมิแพ้ โรคเกี่ยวกับทางเดินหายใจ โรคเครียด",
  },
  {
  "head":"The Empress",
  "imageURL": "https://khamchanod.com/wp-content/uploads/2023/06/M_3.png",
  "detail":"แข็งแรงสมบูรณ์ดี แต่ต้องระวังเรื่องความอ้วน",
  }
  ],
};

/*================================================================================ความหมายไพ่====================================================================*/

const tarotMean = {
  "The Fool": [
    "การงาน: เริ่มต้นงานใหม่ กิจการใหม่ ลาออกจากงานเพื่อพักผ่อน หรือออกมาทำในสิ่งที่รัก รวมไปถึงการถูกไล่ออก ซึ่งล้วนมีความเสี่ยง ต้องรอบคอบและประเมินความเสี่ยงให้ดี อย่ามองโลกในแง่ดีเกินไป ไพ่ใบนี้อาจหมายถึงงานที่เกี่ยวกับการเดินทาง งานที่ได้พบเจอผู้คนบ่อยๆได้ด้วย\n\n" +
    "การเงิน: มีเงินมาก แต่ใช้เงินเก่ง และเก็บเงินไม่เก่ง ขาดวินัยทางการเงิน มักใช้จ่ายเกินตัวเพราะทำตามใจตัวเอง ด้านการลงทุนถือว่ามีความเสี่ยง ต้องศึกษาและวิเคราะห์ความเสี่ยงให้ดีก่อนการลงทุน ต้องระวังเรื่องการกู้ยืมหรือการใช้บัตรเครดิต\n\n" +
    "ความรัก: เป็นคนเจ้าชู้ คนโสดมีโอกาสได้เจอคนใหม่ๆ แต่เราอาจจะรักสนุก รักอิสระอยู่ จึงไม่พร้อมผูกมัดกับใคร คนมีคู่ ต้องระวังการทำร้ายจิตใจคู่รัก อาจไม่ค่อยสนใจหรือใส่ใจเท่าที่ควร ในอีกบริบทหนึ่ง ไพ่ใบนี้อาจหมายถึงการที่เรารักใครมากๆ โดยไม่สนใจว่าเราจะผิดหวัง\n\n" +
    "สุขภาพ: ต้องระวังอุบัติเหตุที่เกิดจากความประมาท ตกจากที่สูง เพราะความประมาท หากเป็นคนที่กำลังจะท่องเที่ยวหรือเดินทาง ระวังอุบัติเหตุในการเดินทาง หรือไปในสถานที่อันตราย\n\n" +
    "ไพ่กลับหัว: การเปลี่ยนแปลงและความไม่แน่นอน ไม่ได้วางแผนรับมือกับอนาคต ใช้ชีวิตแบบไม่กลัวอันตรายเพราะประมาท"
  ],
  "The Magician": [
    "การงาน: เป็นคนสื่อสารเก่ง ฉลาด เรียนรู้เร็ว ทำงานดี นำเสนอเก่ง เหมาะกับงานที่เกี่ยวข้องกับการสื่อสาร งานที่พบปะผู้คนจำนวนมาก\n\n" +
    "การเงิน: หาเงินเก่ง พูดจาเป็นเงินเป็นทอง การเงินคล่องตัว ไม่ขาดมือ แต่ก็ใช้จ่ายเก่งเช่นกัน ไม่ค่อยมีเงินเก็บ เพราะได้มาก็ใช้หมด\n\n" +
    "ความรัก: คนโสดจะพบคนคุยใหม่ แต่ต้องระวังเจอคนไม่จริงใจ เข้ามาฉวยโอกาส เล่ห์เหลี่ยมใส่ หรืออาจะเป็นคนที่ดีแต่ปาก พูดเก่ง แต่อาจไม่ได้เก่งอย่างที่คิด สำหรับคนมีคู่ หากมีเรื่องไม่เข้าใจกัน ตอนนี้ถือเป็นโอกาสที่ดี ที่จะพูดคุยปรับความเข้าใจกัน\n\n" +
    "สุขภาพ: ระวังโรคเกี่ยวกับทางเดินหายใจ ภูมิแพ้ โรคเครียด โรคจิตเวช\n\n" +
    "ไพ่กลับหัว: เกี่ยวกับความไม่ซื่อ การหลอกลวง ความสัมพันธ์ที่เหมือนจะดี อาจจะมีอะไรแอบแฝงอยู่"
  ],
  "The High Priestess": [
    "การงาน: มีเรื่องให้สับสน ว้าวุ่นใจ อารมณ์แปรปรวน ไม่ค่อยมีสมาธิ แต่ยังคงทำงานได้ดี เหมาะกับงานที่ต้องใช้ความคิดสร้างสรรค์ ใช้จินตนาการ ชอบทำงานคนเดียว ทำงานในหน้าที่รับผิดชอบได้ดี\n\n" +
    "ความรัก: หมายถึงความสัมพันธ์ที่ซับซ้อน ไม่ชัดเจน มีความลังเล อาจจะเป็นรักข้างเดียว รักสามเส้า รักคนมีเจ้าของ แอบรักแอบชอบ แต่ไม่กล้าเปิดเผย สำหรับคนมีคู่ ความสัมพันธ์ไม่ค่อยดี มีเรื่องให้กังวลใจ อารมณ์แปรปรวน รวมถึงปัญหารักสามเส้า คบซ้อน นอกใจ\n\n" +
    "สุขภาพ: โดยรวมยังแข็งแรง แต่อาจเจอปัญหาเกี่ยวกับระบบเลือด ฮอร์โมนปรวนแปร วัยทอง โรคภูมิแพ้ ควรระวังระบบย่อยอาหารแปรปรวน โรคเกี่ยวกับของเหลวในร่างกาย เช่น โรคเกี่ยวกับปัสสาวะ โรคเกี่ยวกับเลือด ประจำเดือน\n\n" +
    "ไพ่กลับหัว: หมายถึงความสัมพันธ์ที่ไม่แน่นอน ความสัมพันธ์เชิงชู้สาวที่ไม่ชัดเจน ไม่จริงจัง หรือใช้อารมณ์มากเกินไปทำให้ความสัมพันธ์มีปัญหา"
  ],
  "The Empress": [
    "การงาน: การงานดี การเรียน การศึกษาดี มีเกณฑ์จะได้เลื่อนขั้น เลื่อนตำแหน่ง เลื่อนยศ จะมีการขยายกิจการ เปิดกิจการใหม่ การบริหารงานราบรื่นดี\n\n" +
    "การเงิน: การเงินคล่องตัว มีเงินใช้ไม่ขาดมือ มีทรัพย์สินเงินทอง ถ้าปล่อยกู้หรือมีคนขอยืมจะได้คืนยากหรือช้ามาก ผู้ชายจะมีดวงนารีอุปถัมป์\n\n" +
    "ความรัก: ดี มีเกณฑ์สมหวัง ได้หมั้นหมาย แต่งงาน ความสัมพันธ์ราบรื่น คู่รักดูแลเอาใจใส่กันเป็นอย่างดี มีคู่ที่ส่งเสริมกัน คู่ควรกัน อาจมีการตั้งครรภ์ คนโสด จะได้พบคนที่ถูกใจ มีโอกาสสานสัมพันธ์ถึงขั้นแต่งงาน\n\n" +
    "สุขภาพ: ระวังเรื่องมดลูก โรคอ้วน\n\n" +
    "ไพ่กลับหัว: ความไม่อุดมสมบูรณ์ หรือมีลูกยาก เป็นหมัน ในมุมมองความสัมพันธ์ มันก็จะกลายเป็นว่า เป็นความสัมพันธ์ที่รู้สึกว่าไปต่อไม่ได้ ขาดความเอาใจใส่และขาดความเข้าใจกันและกัน"
  ],
  "The Emperor": [
    "การงาน: คุณเป็นคนฉลาด มีความสามารถสูง มีผู้ใหญ่เห็นความสามารถและให้การสนับสนุน งานก้าวหน้า ประสบความสำเร็จ มีความมั่นคง มีชื่อเสียง\n\n" +
    "การเงิน: เงินไม่ขาดมือ หาเงินเก่ง แต่คุณเป็นคนหน้าใหญ่ สายเปย์ ต้องระวังการใช้จ่ายฟุ่มเฟือย จัดการสินทรัพย์และวางแผนการลงทุนให้ดี\n\n" +
    "ความรัก: สำหรับคนมีคู่ ความสัมพันธ์ของคุณอาจจะดูนิ่งๆ ไม่หวาน ไม่หวือหวา ฝ่ายชายจะมีความเป็นผู้นำสูง มีความสามารถ มีความเป็นผู้นำ แต่อาจมีข้อเสียคือ ฝ่ายชายจะมีนิสัยชอบควบคุม ขี้หึง ที่อาจเป็นปัญหาในความสัมพันธ์ สำหรับคนโสด จะได้พบคนที่ถูกใจ อายุมากกว่า หรือเป็นคนต่างชาติ\n\n" +
    "สุขภาพ: สุขภาพแข็งแรง แต่ต้องระวังเรื่องเกี่ยวกับความเครียด ไมเกรน และการหักโหมงานหนัก พักผ่อนไม่เพียงพอ\n\n" +
    "ไพ่กลับหัว: ข้อเสียของไพ่ใบนี้จะชัดเจนมาก เป็นคนชอบควบคุม เผด็จการ หัวรั้น ชอบแสดงความเป็นเจ้าของ ขี้หึง ทำให้ความสัมพันธ์กับคนรักมีปัญหา"
  ],
  "The Hierophant": [
    "การงาน: การงานราบรื่น ก้าวหน้า มีโอกาสได้เลื่อนขั้น เลื่อนยศ เลื่อนตำแหน่ง ได้ทุนศึกษาต่อ\n\n" +
    "การเงิน: ไพ่ใบนี้ไม่ได้เด่นในด้านการเงิน แต่ไม่มีปัญหาด้านการเงิน มีรายได้จากความรู้ความสามารถ วางแผนการเงินได้ดี\n\n" +
    "ความรัก: ไพ่ใบนี้ไม่ใช่ไพ่ที่เน้นไปในทางความรัก สำหรับคนโสด เป็นความรักแบบเพื่อน เป็นเพื่อนกันไปก่อน หรือดูใจกันแต่ยังไม่ตกลงปลงใจ แต่สำหรับคนมีคู่ หมายถึงการแต่งงาน ถูกต้องตามประเพณี\n\n" +
    "สุขภาพ: ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ และโรคเกี่ยวกับหลัง คอ บ่า ไหล่\n\n" +
    "ไพ่กลับหัว: การละเมิด การละเลย ไม่ทำตามข้อตกลงในความสัมพันธ์หรือสิ่งตามที่ตกลงกันไว้ ผิดจารีต ผิดประเพณี เกิดความไม่เข้าใจ มักเอาตัวเองเป็นที่ตั้ง สำหรับคู่ครอง เกิดปัญหาไม่ทำตามสัญญา ซึ่งจะทำให้ความสัมพันธ์มีปัญหา"
  ],
  "The Lovers": [
    "การงาน: จะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดี หรือมีทางเลือกใหม่ที่ดีขึ้น เจอปัญหาเลือกยาก ตัดสินใจยาก เกิดความลังเล มีเพื่อนร่วมงานดี มีโอกาสเปลี่ยนงาน เลื่อนขั้น เลื่อนยศ เลื่อนตำแหน่ง การทำงานหลายอย่างในเวลาเดียวกัน\n\n" +
    "การเงิน: การใช้เงินอย่างสุรุ่ยสุร่าย ใช้จ่ายตามอารมณ์และความพอใจ ใช้เงินมากไปกับการท่องเที่ยว สังสรรค์ เก็บเงินไม่อยู่\n\n" +
    "ความรัก: คนโสด จะพบคนที่ถูกใจมากกว่าหนึ่งคน แต่จะมีเรื่องที่ทำให้ต้องเลือกและตัดสินใจยาก คนมีคู่ อาจเจอรักซ้อน รักสามเส้า ไม่แฟนเรานอกใจ ก็เป็นเราซะเอง\n\n" +
    "สุขภาพ: ไพ่ใบนี้เป็นกลางๆในเรื่องของสุขภาพ แต่ต้องระวังระวังโรคติดต่อ\n\n" +
    "ไพ่กลับหัว: ความสัมพันธ์ที่เข้ากันไม่ได้ รักสามเส้า การนอกใจ มีปัญหา หรือมีบางสิ่งที่ขาดหายไปในความสัมพันธ์ จนอาจทำให้รู้สึกอยากห่างกันหรือเลิกกันไป หรืออาจหมายถึงตัวเลือกที่เข้ามาไม่ใช่สิ่งที่ดีนัก ทำให้เราอาจตัดสินใจผิดเลือกสิ่งที่ไม่ดีเข้ามาในชีวิตได้"
  ],
  "The Chariot": [
    "การงาน: เจองานหนัก งานยาก ท้าทาย การแข่งขันสูง ต้องใช้ความพยายาม อดทน แล้วจะก้าวข้าวผ่านปัญหาไปได้\n\n" +
    "การเงิน: ต้องเผชิญปัญหาการเงิน มีปัญหาเรื่องสัญญา ปัญหาด้านการลงทุน ต้องเหน็ดเหนื่อยถึงจะได้มา มีเกณฑ์เสียรู้เรื่องการเงิน ต้องจ่ายเงินไปเพื่อให้จบปัญหา แต่สุดท้ายแล้วจะผ่านพ้นปัญหาไปได้\n\n" +
    "ความรัก: คนมีคู่ อาจมีอุปสรรครักทางไกล หรือไม่มีเวลาให้กัน แต่ทั้งคู่รักกันดีและพยายามประคับประคองความสัมพันธ์ต่อไป คนโสด จะพบคนที่ถูกใจจากการเดินทาง หรือเป็นชาวต่างชาติ\n\n" +
    "สุขภาพ: ควรระมัดระวังอุบัติเหตุจากการเดินทาง การขับถ่าย ห้องน้ำ และของมีคม\n\n" +
    "ไพ่กลับหัว: เราไม่สามารถเอาชนะหรือควบคุมสิ่งต่างๆได้ แม้จะพยายามอย่างเต็มที่แล้ว จนทำให้ท้อแท้ สิ้นหวัง จนต้องยอมแพ้ไป"
  ],
  "Strength": [
    "การงาน: คุณเป็นคนเก่ง ขยัน ไม่ต้องพึ่งพาใคร จะได้รับรางวัลแห่งความสำเร็จ\n\n" +
    "การเงิน: เงินที่คาดหวังไว้จะได้ตามคาด ควบคุมเรื่องการเงินได้ จึงทำให้การเงินดีไม่มีปัญหา\n\n" +
    "ความรัก: คนโสดมักจะหาแฟนยากหน่อย เพราะเก่งเกินจนไม่ต้องการความช่วยเหลือ หรือเลือกมากเกินไป คนที่กำลังมีความรัก มีคนคุย มีคนที่ถูกใจ บอกเลยว่าความสัมพันธ์นี้จะต้องใช้เวลา ความอดทน จึงจะสามารถพัฒนาไปสู่ความสัมพันธ์ที่จริงจัง มั่นคง คนมีคู่ หากเป็นหญิงก็เป็นผู้หญิงเก่ง หากเป็นชายก็มักจะเกรงอกเกรงใจภรรยา ต้องหลีกเลี่ยงการใช้อารมณ์ อดทน และเวลาจะช่วยให้ความรักมั่นคงขึ้น\n\n" +
    "สุขภาพ: แข็งแรงมาก มีกำลังใจดี ชอบดูแลตัวเอง\n\n" +
    "ไพ่กลับหัว: การมีความสามารถไม่พอ เข้มแข็งไม่พอ ไม่อดทน ไม่สามารถควบคุมได้ เกิดความสงสัย รู้สึกอ่อนแอ จนทำให้รู้สึกว่าตัวเองแพ้หรือไม่ดีพอ"
  ],
  "The Hermit": [
    "การงาน: เป็นคนชอบทำอะไรคนเดียว เรียนคนเดียว ทำงานคนเดียวแต่มีความสามารถ รู้อะไรรู้ลึกรู้จริง ชอบค้นคว้าหาคำตอบด้วยตัวเอง โดยอีกความหมายหนึ่งคือได้ผู้ใหญ่สนับสนุนเป็นอย่างดี\n\n" +
    "การเงิน: เรื่องเงินอาจจะไม่ใช่เรื่องสำคัญที่สุด อาจจะมีอุดมการณ์บางอย่างที่สำคัญมากกว่าการมีทรัพย์สินเงินทองมากมาย แต่พอมีพอกิน มีเงินใช้จ่ายตามสมควร\n\n" +
    "ความรัก: ไพ่ใบนี้สำหรับคนโสด รักสันโดษ ชอบอยู่คนเดียว อาจจะยังไม่อยากมีใคร หรือยังไม่เจอคนที่ถูกใจในช่วงนี้ สำหรับคนมีคู่ ความรักราบเรียบ ไม่หวือหวา ความรักเริ่มจืดชืด อาจต้องไตร่ตรองเรื่องความสัมพันธ์อีกครั้ง ถึงเวลาที่ต้องห่างกันสักพัก รู้สึกเหงา หรือได้แต่งงานตอนแก่ คนโสด รักสันโดษ ชอบอยู่คนเดียว อยู่กับตัวเองมากกว่าจะให้คนอื่นมาวุ่นวายกับชีวิต อาจมีคนรักเก่ากลับเข้ามาคุยอีกครั้ง ยังวนเวียนคิดถึงคนรักเก่า คนมีคู่ ความรักราบเรียบ ไม่หวือหวา ความรู้สึกห่างเหิน ความรักเริ่มจืดชืด อาจต้องไตร่ตรองเรื่องความสัมพันธ์อีกครั้ง เพราะบางทีการที่อยู่ด้วยกันมากหรือนานเกินไปก็อาจจะทำให้เกิดความคับข้องใจบางอย่าง หรือมีปัญหาที่แก้ไม่ตก การห่างกันเพื่อให้ได้เห็นว่าจริงๆแล้ว ข้างในเรารู้สึกยังไง ต้องการอะไร\n\n" +
    "สุขภาพ: สุขภาพไม่มีอะไรน่าห่วง แต่มักจะมีโรคของคนแก่รบกวน เช่น ปวดหลัง ปวดไหล่ ปวดเอว ปัญหาทางด้านสายตา โรคทางจิตเวช หรืออาจหมายถึงจะได้หมอที่เชี่ยวชาญและมีประสบการณ์สูงมาช่วยรักษาให้ก็เป็นไปได้\n\n" +
    "ไพ่กลับหัว: ไพ่ใบนี้ในกรณีกลับหัว จะหมายถึงการแยกตัวออกมาแล้วค้นหาคำตอบไม่ได้ หาทางออกไม่เจอ มองไม่เห็นทางข้างหน้าที่จะไปต่อ การที่ผู้ใหญ่เลิกสนับสนุน หรือมีปัญหากับผู้ใหญ่"
  ],
  "Wheel Of Fortune": [
    "การงาน: มีเกณฑ์ต้องพบการเปลี่ยนแปลง โอกาสดี ๆ เรื่องการงานมาถึงแล้ว ต้องขยัน จะมีความก้าวหน้าในหน้าที่การงาน มีการเลื่อนขั้นเลื่อนตำแหน่ง มีช่องทางทำมาหากินใหม่ ๆ งานขยายตัว มีการเติบโต\n\n" +
    "การเงิน: ช่วงนี้ต้องตั้งสติให้มั่น จะมีการเคลื่อนย้ายของเงิน อาจมีแหล่งรายได้ใหม่ หรือในแง่ลบ อาจมีรายจ่ายที่คาดไม่ถึงก็ได้ รวมไปถึงกู้หนี้ยืมสิน ปิดหนี้ และอาจจะมีโชคจากการเสี่ยงดวง\n\n" +
    "ความรัก: ความรักสำหรับไพ่ใบนี้ หมายถึงการเปลี่ยนแปลงในความสัมพันธ์ โดยส่วนใหญ่ไพ่ใบนี้จะแปลว่าโชคดีในด้านความรัก คนโสด มีโอกาสเจอคนที่ถูกใจ เจอคู่แท้ คนที่กำลังคุยกันจะได้พัฒนาความสัมพันธ์ สำหรับคนมีคู่ ความสัมพันธ์กำลังจะมาถึงจุดเปลี่ยน\n\n" +
    "สุขภาพ: ใครที่ป่วยอยู่มีแนวโน้มที่สุขภาพจะดีขึ้น ใครที่ป่วยเรื้อรังรักษาไม่หายขาดสักทีก็มีโอกาสได้ค้นพบการรักษาวิธีใหม่ๆ\n\n" +
    "ไพ่กลับหัว: การเปลี่ยนแปลงของโชคชะตา โชคชะตาไม่เป็นใจ การเปลี่ยนแปลงที่ทำให้เลวร้ายลง หรือเป็นการเปลี่ยนแปลงที่เราไม่อยากให้เกิดขึ้น"
  ],
  "Justic": [
    "การงาน: ได้รับการยอมรับนับถือ ทุ่มเทให้กับงาน ต้องแบ่งเวลาให้สมดุล แบ่งผลประโยชน์ให้ยุติธรรม ต้องใช้สติปัญญาให้มาก ทำอะไรต้องละเอียดรอบคอบมากขึ้น จึงจะผ่านปัญหาไปได้ และให้ระวังปัญหาในเรื่องเอกสารสัญญา กฎหมาย หรือตัวเลขต่างๆ อาจเกิดความผิดพลาดได้\n\n" +
    "การเงิน: การเงินมั่นคง รายได้ดี ได้เงินจากการทุ่มเททำงาน ได้เงินจากคดีความ การฟ้องร้อง มีความสามารถในการจัดการเรื่องการเงินได้ดี สมดุล แม้ว่าได้มาก็จ่ายออกไป ต้องใช้ปัญญาและการวางแผนในเรื่องของการเงินให้ดี\n\n" +
    "ความรัก: มีความสมดุลในความรัก สามารถดำเนินความรักความสัมพันธ์อยู่ได้อย่างไม่มีปัญหา สามารถใช้เหตุผลแก้ไขปัญหาได้มากกว่าใช้อารมณ์ หรืออาจะบอกว่าให้ใช้การตัดสินใจด้วยเหตุด้วยผลในการแก้ปัญหาในเรื่องของความรักให้เด็ดขาดซักที เช่น ถึงเวลาแล้วที่คุณจะตัดสินใจด้วยเหตุด้วยผลว่า คุณจะเดินหน้าความสัมพันธ์ต่อไหม หรือควรจะเดินจากไป เป็นต้น\n\n" +
    "สุขภาพ: ไม่ค่อยเจ็บป่วย แต่ก็ไม่ได้ดีมาก ควรระวังโรคออฟฟิศซินโดรม ความเครียด โรคจิตเภช\n\n" +
    "ไพ่กลับหัว: ความไม่ยุติธรรม ความไม่ซื่อสัตย์ ความไม่เท่าเทียม ความไม่สมดุล ไม่เคารพกฎเกณฑ์ ทำผิดกฎหมาย การใช้อารมณ์มากกว่าเหตุผล การเอาเปรียบซึ่งกันและกัน การทำผิดต่ออีกคนหนึ่ง"
  ],
  "The Hanged Man": [
    "การงาน: ต้องอดทนและใช้ความพยายามให้มาก มีปัญหาต้องฟันฝ่า มีเรื่องที่ยังคาราคาซัง ยังแก้ไม่ได้ในทันที ต้องทนอยู่กับมันซักระยะหนึ่ง แต่วันหนึ่งคุณจะผ่านมันไปได้ และในอนาคตคุณจะเห็นว่าคุณได้ประสบการณ์ที่มีค่าและจะได้ประโยชน์จากมันอย่างสูง\n\n" +
    "การเงิน: จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน การเป็นหนี้ก้อนใหญ่ มีภาระทางการเงินหรือรายจ่ายที่ต้องรับผิดชอบมาก การที่ไม่ได้เงินตามกำหนด การเงินมีเกณฑ์ฝืดเคือง ต้องเปลี่ยนแปลงรูปแบบการหาเงิน และวางแผนการใช้จ่ายเงินให้รัดกุม มีประสิทธิภาพมากกว่าเดิม ไม่ใช้จ่ายเงินแบบเดิม\n\n" +
    "ความรัก: ต้องเสียสละ ต้องอดทน ต้องทรมาน เพื่อให้ความสัมพันธ์จะดำเนินต่อไปได้ คนโสด ยังฝังใจอยู่กับรักเก่า เรื่องราวเก่า ๆ ไม่พร้อมจะเริ่มต้นความรักใหม่ คนมีคู่ ไม่มีความสุข แต่ต้องอดทน ไม่สามารถจะเลิกหรือเดินออกไปได้ในตอนนี้ ในอีกแง่หนึ่ง หมายถึงการพัก เว้นระยะหรือห่างกัน เพื่อทบทวนความสัมพันธ์ ซึ่งก็มีโอกาสที่จะทำให้มองเห็นมุมมองใหม่ๆและวิธีที่จะใช้ในการแก้ปัญหาของความสัมพันธ์ก็ได้\n\n" +
    "สุขภาพ: ให้ระวังเรื่องสุขภาพให้มาก ให้ระวัง ขา ท้องและศีรษะ ระวังพวกโรคกระเพาะ โรคกรดไหลย้อน โรคเครียด เส้นเลือดในสมอง โรคความดัน เป็นต้น\n\n" +
    "ไพ่กลับหัว: ได้รับความทรมาน เจอความกดดัน แต่ไม่เข้าใจ ปรับตัวไม่ได้ ยังดันทุรังจะใช้ชีวิตแบบเดิม ใช้วิธีการแก้ปัญหาแบบเดิม"
  ],
  "Death": [
    "การงาน: มีแนวโน้มว่าจะล้มเหลว ผิดหวัง เลิกกิจการ หุ้นส่วนแตกคอกัน เผชิญกับปัญหาที่ทำให้เครียด กดดัน ทำงานอย่างไม่มีความสุข อาจตัดสินใจลาออก เปลี่ยนงาน สถานการณ์ไม่เป็นไปตามที่คาดหวัง หมดหวัง ต้องหาทางเอาตัวรอดใหม่ ธุรกิจขาดทุน อาจต้องปิดกิจการเก่าเพื่อทำอย่างอื่น แต่ในแง่ดีอาจหมายถึงการที่เราผิดงานนั้นๆได้ และได้เริ่มงานใหม่ ก็ได้\n\n" +
    "การเงิน: มักจะต้องมีเรื่องสูญเสียเงิน มีเรื่องใช้จ่าย ทรัพย์สินโดนขโมย หรือเงินหาย บางคนอาจถูกฟ้อง หรือกำลังจะจบคดีความ ต้องใช้หนี้ใช้สิน หรืออาจจะแปลได้ว่าต้องมีการลงทุนเพื่อเริ่มต้นสิ่งใหม่ๆ โดยจะต้องเป็นการลงทุนที่ใหญ่และสำคัญพอสมควร\n\n" +
    "ความรัก: ไพ่ใบนี้อาจแปลความหมายไปในทางดีหรือไม่ดีก็ได้เพราะมีความหมายถึงการสิ้นสุดหรือการเปลี่ยนแปลงในความสัมพันธ์ เพื่อเริ่มต้นใหม่หรือไปสู่สถานะใหม่ คนโสดอาจสมหวัง ได้เจอคนที่ถูกใจ คนคุยหรือเพื่อนเปลี่ยนเป็นแฟน คนมีคู่อาจผิดหวัง แฟนอาจเลิกกันแล้วเปลี่ยนเป็นเพื่อน ห่างกัน หย่าร้าง หรือสมหวังก็ได้ เช่น ความสัมพันธ์ที่ไม่ดีอาจเปลี่ยนเป็นดี ซึ่งต้องดูไพ่ใบอื่นๆประกอบ เพื่อหาคำตอบของการเปลี่ยนแปลง\n\n" +
    "สุขภาพ: ไพ่ใบนี้ให้ความหมายที่ไม่ดีในเรื่องสุขภาพ ถ้าคุณแข็งแรงดีอยู่มีเกณฑ์ต้องเจ็บไข้ได้ป่วย หรือบาดเจ็บ ถ้าคุณป่วยหนักอยู่อาการอาจทรุดลงได้\n\n" +
    "ไพ่กลับหัว: ความไม่พร้อมที่จะเริ่มต้นใหม่ ไม่สามารถเปลี่ยนแปลง ไม่ยอมเปลี่ยนแปลง ไม่พร้อมจบเรื่องเก่า แล้วเริ่มต้นใหม่ มีความหลังที่ไม่เลวร้าย แต่ไม่สามารถลืมได้ ไม่สามารถจบแล้วเริ่มต้นใหม่ได้"
  ],
  "Temperance": [
    "การงาน: มีเรื่องต้องปรับตัว หรือมีการเปลี่ยนแปลงเกิดขึ้น จะมีโอกาสย้ายงาน มีเพื่อนร่วมงานใหม่ หรือออกจากงาน รวมไปถึงมีการเดินทางไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ\n\n" +
    "การเงิน: ไม่มั่นคง สถานการณ์การเงินในอนาคตยังไม่แน่นอน อาจกำลังหาจุดลงตัวในเรื่องของการใช้จ่ายกับเงินที่หามาได้ หรือหาได้ก็จ่ายออกไปหมดเข้าทำนองเงินเข้ากระเป๋าซ้ายออกกระเป๋าขวา หรือแปลว่าจะมีการโอนย้ายถ่ายเททางการเงิน เพื่อจุดประสงค์อะไรบางอย่าง ให้ควบคุมรายรับรายจ่ายให้สมดุล ต้องมีการปรับเปลี่ยนแผนการใช้เงินให้รัดกุม\n\n" +
    "ความรัก: ความรักหรือความสัมพันธ์ของเรากำลังอยู่ในช่วงปรับตัวหรือปรับความเข้าใจกัน อาจจะเป็นช่วงเริ่มต้นในการคบหากันใหม่ๆ หรือคบกันมานานแล้วแต่มีปัญหา การกระทำอะไรที่มากเกินไปหรือน้อยเกินไปที่ทำให้อีกฝ่ายอึดอัด เราก็จะต้องถอยออกมา หรือปรับเปลี่ยนแบบค่อยๆเป็นค่อยๆไป เพื่อให้ความสัมพันธ์ดีขึ้น มั่นคงขึ้น หรืออาจหมายถึงการที่เรากำลังปรับใจตัวเองยอมรับในข้อเสียของอีกฝ่ายก็ได้ หรืออาจจะแปลได้ว่ามีความโลเลไม่แน่ใจในความสัมพันธ์เกิดขึ้นก็ได้\n\n" +
    "ในกรณีที่ยังโสด: อาจจะหมายความว่าอยู่ในช่วงการทดลองอยู่คนเดียวให้มีความสุข หรือกำลังเริ่มทดลองคุยกับคนใหม่ๆอยู่ก็เป็นไปได้ แต่ไพ่ใบนี้จะบอกถึงความรู้สึกกล้าๆ กลัวๆ อยู่ซักหน่อย ยังไม่มั่นใจในอะไรบางอย่าง\n\n" +
    "สุขภาพ: ระวังโรคภัยที่เกี่ยวข้องกับน้ำหรือมีสาเหตุมาจากน้ำ การทำงานโดยไม่หยุดพัก ทำให้ร่างกายอ่อนแอ เป็นหวัด มีน้ำมูก ภูมิแพ้ ท้องเสีย ท้องร่วง โรคเกี่ยวกับเลือด น้ำกัดเท้า น้ำในหูไม่เท่ากัน เป็นต้น\n\n" +
    "ไพ่กลับหัว: ความไม่สมดุล มากไปหรือน้อยไป สุดโต่ง ความไม่พยายามหรือไม่อดทนพอ ซึ่งจะทำให้เกิดปัญหาต่างๆตามมา หรือมีอะไรที่ทำให้ไม่สามารถจบแล้วเริ่มต้นใหม่ได้"
  ],
  "The Devil": [
    "การงาน: จะมีงานเข้ามามาก แต่งานสายเทาหรืองานที่เกี่ยวข้องกับอบายมุข งานที่มีเรื่องเซ็กซ์เรื่องเพศเข้ามาเกี่ยวข้อง งานที่เป็นความลับ เช่น นักสืบ ทนายความ บ่อน พนัน ผับบาร์ อาบอบนวด นำเข้าของผิดกฏหมาย เป็นต้น ในอีกแง่หนึ่ง ไพ่ใบนี้หมายถึงการติดสัญญาบางอย่าง ทำให้ไม่สามารถดำเนินการไปต่อได้ ต้องอยู่ในสถานการณ์ที่อึดอัดต่อไป แม้กระทั่งการติดคุกติดตารางก็เป็นไปได้\n\n" +
    "การเงิน: โซ่ตรวนบนไพ่หมายถึงภาระทางการเงินที่มีปัญหา หนี้สินก้อนโตที่จัดการไม่ได้ ภาระค่าใช้จ่ายบางอย่างทางด้านการเงินที่ไม่สามารถปลดออกไปได้\n\n" +
    "ความรัก: เป็นความรักที่เกิดจากความลุ่มหลง จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ แต่ในที่สุดก็จะพบว่าไปด้วยกันไม่ได้ เช่น ชื่นชอบกันด้วยหน้าตา เซ็กส์ หรือแม้กระทั่งเรื่องเงิน หรืออาจจะแปลว่า การมีชู้ การรักสามเส้า การนอกใจ การผิดศีล การโกหกหลอกลวง ก็เป็นไปได้ แต่ความรักที่เกิดจากความลุ่มหลงก็เป็นความรักแบบหนึ่ง และอาจพัฒนาไปเป็นความรักที่ดีขึ้นก็ได้\n\n" +
    "สุขภาพ ไพ่ใบนี้เตือนให้คุณระวังโรคลับที่คุณอาจจะยังไม่รู้ตัว เจ็บป่วยจากการไม่ดูแลตัวเอง โรคที่เกิดจากกิจวัตรที่ไม่ดี โรคที่ต้องใช้ระยะเวลาแฝงตัวสักระยะหนึ่ง เช่น โรคติดต่อทางเพศสัมพันธ์ โรคจากการดื่มเครื่องดื่มแอลกอฮอล์ โรคมะเร็ง โรคเบาหวาน โรคไทรอยด์\n\n" +
    "ไพ่กลับหัว: ไพ่ใบนี้กลับหัวกลับจะมีความหมายในทางที่ดี นั่นคือ การหลุดพ้นจากสิ่งที่ยึดติด เป็นอิสระ หลุดพ้นจากสิ่งที่เสพติด มีความสัมพันธ์แบบรู้ผิดชอบชั่วดี ไม่หลงใหลหัวปักหัวปำ สามารถควบคุมตัวเองได้ดีขึ้น"
  ],
  "The Tower": [
    "การงาน: ระวังจะเกิดการเปลี่ยนแปลงโดยกระทันหันในเรื่องการเรียนการงาน สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังลงอย่างไม่คาดคิด ปัญหาจะเกิดกะทันหัน การทะเลาะเบาะแว้ง การยุบ ล้มเลิก หรือเปลี่ยนแปลง โยกย้ายอย่างกระทันหัน ตกงาน โดนไล่ออก ปัญหาที่เกิดขึ้นโดยไม่คาดคิด\n\n" +
    "การเงิน: ระวังมีเรื่องเสียเงินแบบไม่คาดฝัน มีรายจ่ายที่ไม่ได้คาดไว้ หรือมีสิ่งของเสียหาย ถูกโกง ถูกเบี้ยวหนี้ คดีความที่เกี่ยวข้องกับเรื่องเงิน ๆ ทอง ๆ หากใครที่กำลังคาดหวังเรื่องการเงิน จะมีโอกาสผิดหวังสูง ให้ลดความคาดหวังลง และคิดหาทางแก้ไขเผื่อไว้เลยยิ่งดี\n\n" +
    "ความรัก: การจบลงหรือเปลี่ยนแปลงอย่างกะทันหัน อกหัก หย่าร้าง คนโสด ไม่มีความสุข กดดัน ความรักไม่เป็นอย่างที่คิด ผิดหวัง คนมีคู่ มีการทะเลาะเบาะแว้ง พูดคุยกันไม่เข้าใจ ใช้อารมณ์มากกว่าเหตุผล การเลิกรา ห่างไกลกัน การพลัดพราก เสียใจ ผู้ที่ได้ไพ่ใบนี้ในเรื่องความรัก จึงต้องมีสติเตรียมรับมือกับปัญหาให้ดี\n\n" +
    "สุขภาพ: ให้ระวังอุบัติเหตุต่างๆ หรือโรคที่เกิดขึ้นกระทันหัน อุบัติเหตุ เข้าโรงพยาบาล เจ็บป่วยกระทันหัน แก้เคล็ดด้วยการบริจาคโลหิต หรือปรับปรุงซ่อมแซมที่อยู่อาศัย เช่น ของตกใส่ มีดบาด รถล้ม รถชน ลื่นล้ม หน้ามืด เป็นลม หัวใจวาย เส้นเลือดในสมองแตก เป็นต้น โดยถ้าเป็นอาการป่วยก็จะถึงขั้นป่วยหนัก อาการทรุดหนัก เลยทีเดียว\n\n" +
    "ไพ่กลับหัว: ไพ่ใบนี้กลับหัว แปลว่า เป็นการเปลี่ยนแปลง การพังทลาย ที่ไม่รวดเร็ว ไม่กะทันหัน แต่ยังคงดำเนินไปอยู่ ถ้าเป็นความรักยังต้องอยู่กับปัญหา อดทนเพื่อบางสิ่งบางอย่าง ตัดไม่ขาด พยายามฝืนอยู่ต่อไป แต่แน่นอนว่าความเปลี่ยนแปลงนั้นก็ยังเปลี่ยนไปเรื่อยๆ โดยไม่สามารถต้านทานขัดขวางได้"
  ],
  "The Star": [
    "การงาน: ไพ่ใบนี้บ่งบอกถึงการมีความหวัง เช่น หวังว่าจะสอบได้คะแนนดี หวังว่าจะได้เลื่อนตำแหน่ง กำลังจะได้เปลี่ยนที่เรียนหรือเปลี่ยนที่ทำงาน ซึ่งก็มีโอกาสสูงที่คุณจะได้มัน เพียงแต่ไพ่ใบนี้บอกให้คุณอย่าลืมดูแลอารมณ์ของตัวเอง รวมถึงสิ่งภายนอกต่างๆ หากมีภาระหน้าที่อะไรก็พยายามทำให้ดีที่สุด อย่าพึ่งทิ้งสิ่งใด หรือมองข้ามเรื่องอื่นๆในชีวิต\n\n" +
    "การเงิน: ไพ่ใบนี้บ่งบอกถึงการมีความหวังในเรื่องการเงิน มีรายได้เข้ามาเรื่อย ๆ ได้รับข่าวดีเรื่องเงิน สิ่งที่ลงทุนไปกำลังผลิดอกออกผล\n\n" +
    "ความรัก: ไพ่ใบนี้หมายถึงการที่เรามีความหวังในความสัมพันธ์ โดยถ้าเป็นความรักใหม่ ก็จะเป็นความรักที่ดูดี มีความหวัง แต่ถ้าเป็นความสัมพันธ์ที่ไม่ดีที่มีอยู่ ไพ่ใบนี้ก็จะหมายความว่า ถึงเวลาแล้วที่เราจะต้องดูแล ฟื้นฟูรักษาตัวเองให้ดี ทั้งในด้านจิตใจและร่างกาย เพราะความสดใส ความหวังใหม่ๆ กำลังรอคอยเราอยู่ข้างหน้า\n\n" +
    "สุขภาพ: คนที่ป่วยอยู่ตอนนี้คุณมีความหวังที่จะหายแล้ว อาจจะเจอวิธีการรักษาใหม่ๆ เจอหมอเก่งๆ หรือมีสิ่งที่ทำให้คุณสุขภาพดีขึ้น แต่หากเป็นคนที่ไม่ป่วยหรือหายป่วยแล้ว ไพ่ใบนี้บอกคุณว่าให้คุณเร่งฟื้นฟูสภาพร่างกายและจิตใจ เช่น ออกกำลังกาย นั่งสมาธิ หรือเล่นโยคะ เพราะสิ่งที่ดีๆ สิ่งที่จะทำให้เกิดความหวัง กำลังจะเกิดขึ้นกับคุณ\n\n" +
    "ไพ่กลับหัว: ไพ่ใบนี้กลับหัวมีความหมายถึง การหมดหวัง สิ้นหวัง ไม่สามารถเริ่มต้นใหม่ได้ การที่ไม่สามารถดูแลควบคุมอารมณ์ตัวเองได้ และยังไม่สามารถดูแลสิ่งต่างๆภายนอกได้อีกด้วย ทำให้ความสัมพันธ์หรือเรื่องอื่นๆมีปัญหาตามมา"
  ],
  "The Moon": [
    "การงาน: ไพ่ใบนี้บอกว่าคุณกำลังวิตกกังวล ทางออกทางเดียวที่คุณมีอยู่คือเผชิญหน้าสู้กับมันไม่ใช่เอาแต่วิตกกังวลอยู่แบบนี้ อย่าวู่วาม แม้จะมีคนกลั่นแกล้ง ต้องระมัดระวังปัญหาเกี่ยวกับเอกสารต่าง ๆ\n\n" +
    "การเงิน: ไพ่ใบนี้บ่งบอกถึงความวิตกกังวลในเรื่องการเงิน อาจจะหมายถึงการมีเรื่องเงินมาให้ตัดสินใจหรือกวนใจ ซึ่งก่อให้เกิดความกลัว ความวิตกกังวล อาจจะหมายถึงกลัวว่าเงินจะไม่พอใช้จ่าย กังวลเรื่องหนี้สินต่างๆ กังวลเรื่องภาระระยะยาว เช่นเรื่องลูกเรื่องครอบครัว เรื่องค่าใช้จ่ายด้านสุขภาพ เป็นต้น\n\n" +
    "ความรัก: ไพ่ใบนี้ในเชิงความรัก หากเป็นคนโสดไพ่ใบนี้บอกว่าคุณกำลังเหงา คุณอยากได้ใครสักคนเข้ามาในชีวิต คนที่พร้อมจะมามาร่วมทุกข์ร่วมสุข เพื่อที่จะก้าวไปข้างหน้าด้วยกัน หากกำลังมีความรักอยู่ จะบอกถึงความรู้สึกที่อ่อนไหว ความรู้สึกคิดถึง ความห่วงใย หรือมีบางอย่าง บางเหตุการณ์ที่ทำให้เรารู้สึกไม่มั่นคง ซึ่งจริงๆแล้วมันอาจจะไม่ได้เป็นอย่างนั้นก็ได้ หรือเป็นไปได้ว่าความสัมพันธ์เดินมาถึงทางที่ต้องเลือก ซึ่งยังมีความกังวล ความลังเลในทางเลือกอยู่ เนื่องจากความดีความชั่ว ภาระ หรือความรับผิดชอบต่างๆ ที่ทำให้เราไม่สามารถเลือกได้ซักที เรียกว่าถ้าเลือกทางไหนก็มีความทุกข์ มีปัญหารออยู่ และอาจเป็นการเลือกที่เปลี่ยนชีวิตของเราไปตลอดกาล\n\n" +
    "สุขภาพ: โรคเกี่ยวกับผู้หญิง โรคเกี่ยวกับการมีบุตร ความเครียด ความวิตกกังวล การนอนไม่หลับ และสุขภาพจิต สำหรับผู้ที่ป่วยอยู่อย่ากังวลหรือกลัวมากจนเกินไป โรคที่คุณเป็นอยู่อาจไม่ร้ายแรงอย่างที่คิดก็ได้ ต้องระมัดระวังเรื่องของการพักผ่อนไม่เพียงพอจะทำให้สุขภาพโดยรวมแย่ลงได้\n\n" +
    "ไพ่กลับหัว: แม้จะมีความกังวล ความกลัว ต่อปัญหาและสิ่งที่เกิดขึ้น หรือกังวลกับสิ่งที่เข้ามาเป็นทางเลือกให้ต้องตัดสินใจ แต่คุณจะไม่ยอมอยู่เฉยๆ จะพยายามต่อสู้กับความรู้สึกนั้น และจะตัดสินใจอย่างเด็ดขาด เพื่อให้มันผ่านไป ตัดสินใจบางอย่างเพื่อเดินหน้าต่อไป"
  ],
  "The Sun": [
    "การงาน: แม้จะมีอุปสรรคบ้างคุณก็สามารถผ่านมันได้แบบไม่ลำบากมาก หรืออาจทายได้ว่ามีการจบลงแล้วเริ่มต้นใหม่ เช่น เปลี่ยนที่เรียนใหม่ จบการศึกษา เริ่มต้นทำงานใหม่ ทำงานสำเร็จ เปลี่ยนที่ทำงานใหม่ ซึ่งการเริ่มต้นใหม่นี้ก็เป็นการเริ่มต้นที่สดใส มีความหวัง และคุณน่าจะมีความสุขไปกับมัน\n\n" +
    "การเงิน: หากรอข่าวใดอยู่ จะได้รับข่าวดี มักจะมีชื่อเสียงในการทำงานก่อน เงินจึงจะได้รับตามมาภายหลัง การเงินคล่องตัว ยิ่งทำงานมากยิ่งได้เงินมาก มีช่องทางใหม่ ๆ ที่จะสร้างรายได้จากการเข้าสังคม การติดต่อผู้คน ยิ่งขยันยิ่งได้เงินเยอะ เงินที่นำไปลงทุนไว้แล้วออกดอกออกผล\n\n" +
    "ความรัก: คนโสดอาจจะเริ่มมีความหวังกับความรักครั้งใหม่ คนมีคู่ ก็อาจทำนายได้ว่าเป็นความรักที่สดใส เป็นความรักที่มีความหวัง เป็นความสัมพันธ์ที่ดี ที่มีความสุข\n\n" +
    "หากเป็นคนที่ความรักมีปัญหา: ไม่เข้าใจกัน มีเรื่องขุ่นหมองใจ ไพ่ใบนี้บอกว่าสิ่งเหล่านั้นอาจจะกำลังคลี่คลายไป จะมีความเข้าใจกันมากขึ้น สิ่งที่ขุ่นมัวก็จะได้รับการแก้ไขสะสาง เกิดมีความหวังความสดใสในความสัมพันธ์อีกครั้ง ในอีกแง่หนึ่ง ทำนายได้ว่าสิ่งต่างๆที่ถูกปกปิดไว้ได้ถูกเปิดเผย เช่น คนรักของเรามีชู้ มีการคบซ้อน เมื่อเรารู้ทำให้เราสามารถจบความรักเก่าและมีความรักใหม่ได้ซักที นอกจากนี้ยังสามารถบ่งบอกถึงการที่จะมีลูกได้ด้วย\n\n" +
    "สุขภาพ: แข็งแรง สุขภาพดี มีพลังที่จะทำสิ่งต่างๆได้ตามที่หวัง หรือหายป่วยแล้วกลับมามีพลัง ได้กลับมาดำเนินชีวิตตามปกติอีกครั้ง คนที่เจ็บป่วยจะฟื้นตัวในเร็ววัน\n\n" +
    "ไพ่กลับหัว: ความรู้สึกไม่สดชื่น หมดหวัง ท้อแท้ สิ่งที่หวังไม่เป็นไปตามที่คาดไว้ รู้สึกไม่มีพลัง ไม่อยากจะเริ่มต้นใหม่ อาจจะเจอความไม่ชัดเจน ต้องพบเจอกับเรื่องบางอย่างที่เหมือนถูกปิดบังเอาไว้"
  ],
  "Judgement": [
    "การงาน: มีการตัดสินในที่จะมีผลให้บางอย่างสิ้นสุดลง และมีการเริ่มต้นใหม่ มีการเปลี่ยนแปลง เช่น จะได้งานใหม่ ย้ายตำแหน่งหน้าที่การงาน การเริ่มต้นงานใหม่ในทิศทางที่ดีกว่าเดิม มีโอกาสใหม่ ๆ เข้ามาให้เลือก ให้ตัดสินใจ เป็นผลจากการกระทำของตนเอง\n\n" +
    "การเงิน: มีการเปลี่ยนแปลงเรื่องการเงินโดยจะเป็นผลมาจากการกระทำในอดีต หากรู้จักใช้จ่าย รู้จักเก็บเงิน รู้จักลงทุน ผลของการกระทำนั้นจะออกดอกออกผลแล้ว แต่หากที่ผ่านมาใช้จ่ายสุรุ่ยสุร่าย สร้างหนี้สร้างสินไว้มากๆ วันนี้คุณจะได้รับผลของมันแล้วเช่นกัน\n\n" +
    "ความรัก: เป็นเรื่องที่ต้องตัดสินใจ โดยการกระทำที่มีร่วมกันมาจะเป็นตัวกำหนดว่าสถานภาพความรักของคุณว่าจะเป็นไปในทิศทางไหน ซึ่งหากดำเนินความสัมพันธ์มาไม่ดีก็คงเป็นอันต้องแยกจากกันไป แต่หากการกระทำร่วมกันที่ผ่านมาดี ก็มีโอกาสคบเป็นแฟน หรือแต่งงานกัน\n\n" +
    "สุขภาพ: ไพ่ใบนี้มีความหมายที่ดีในเรื่องสุขภาพ หมายถึง การเปลี่ยนแปลงในเรื่องสุขภาพ ถ้าป่วยก็จะฟื้นตัว อาการจะดีขึ้นในเร็ว ๆ นี้ ถ้ายังไม่ป่วยก็จะป่วยเป็นโรคเดิม แต่คนพื้นดวงดีจะยังคงแข็งแรง จะเริ่มดูแลตัวเองดีขึ้น คนที่เจ็บป่วย\n\n" +
    "ไพ่กลับหัว: การหลีกหนีความจริง การไม่ตัดสินใจ ความอ่อนแอ การหนีปัญหา ความล่าช้า ความไม่ชัดเจน ยังมีสิ่งที่ปกปิดไว้ เริ่มต้นใหม่ไม่ได้ ทำให้ไม่สามารถดำเนินความสัมพันธ์ต่อไปได้"
  ],
  "The World": [
    "การงาน: มีความสุขความพอใจในเรื่องการเรียนการงาน ไม่ได้หมายความว่าทุกอย่างจะราบรื่นไปทั้งหมด แต่บอกว่าสามารถรับมือได้ อุปสรรคต่างๆที่เข้ามาสามารถสู้ได้ แก้ไขได้ และค่อนข้างพอใจในผลของมันด้วย งานที่ทำมานานจะประสบความสำเร็จตามที่หวัง\n\n" +
    "การเงิน: ไพ่ใบนี้บอกว่ามีความพอใจในเรื่องการเงิน อาจไม่ได้แปลว่าจะได้เงินมากมาย แต่แปลได้ว่าจัดการได้ การเงินคล่องตัว หรืออาจมีการจบสิ้นของภาระการเงินบางอย่าง เช่น การปิดหนี้ การเก็บเงินได้ถึงเป้าหมายที่ตั้งใจไว้ ได้ซื้อของที่หวังไว้มาตั้งนาน\n\n" +
    "ความรัก: ความรักอันสมบูรณ์ มีความสุข มีความพอใจในความรัก แม้ความรักจะไม่หวานชื่น และมีอุปสรรคปัญหาบ้าง แต่ก็เข้าใจและพอใจในความรักตอนนี้แล้ว คนโสด มีคนสนใจคุณ มีเกณฑ์เจอคนที่ถูกใจ เจอคู่จากการเดินทางไกล เจอคู่ต่างชาติ เจอคู่ทางออนไลน์ คนมีคู่ ความรักและความสัมพันธ์ราบรื่น มีการวางแผนอนาคตร่วมกัน วางแผนใช้ชีวืตคู่ร่วมกัน คนที่ทะเลาะกับคนรัก จะได้ปรับความเข้าใจ และกลับมารักกันเหมือนเดิม\n\n" +
    "สุขภาพ: แข็งแรง สุขภาพดี มีความพอใจในสุขภาพในตอนนี้ คนที่ป่วยมานานก็จะหายขาด หรืออย่างน้อยก็ดีขึ้นในระดับที่น่าพึงพอใจ\n\n" +
    "ไพ่กลับหัว: ความไม่พอใจในตนเอง การมีอุปสรรค หลายเรื่องไม่เป็นไปตามที่หวังไว้ ผลออกมาไม่เป็นที่พึงพอใจ ความสำเร็จยังต้องรอ ไม่มีอิสระในความคิดหรือการกระทำ"
  ],
};

/*=================================================================================บทสวด===================================================================*/

const Prayers = {
  หลวงพ่อโต: [
  "ชิ นะ ปัญ ชะ ระ ปะ ริ ตัง มัง\n" +
  "รัก ขะ ตุ สัพ พะ ทา\n" +
  "(ภาวนา 10 จบ)\n" +
  "ก่อนสวดให้นึกถึง หลวงปู่โต พรหมรังสี\n" +
  "แล้วตั้งจิตอธิษฐานว่าดังนี้\n\n" +
  "ปุตตะกาโมละเภปุตตัง ธะนะกาโมละเภธะนัง\n" +
  "อัตถิกาเยกายะญายะ เทวานังปิยะตังสุตตะวา\n" +
  "อิติปิโสภะคะวา ยะมะราชาโน ท้าวเวสสุวัณโณ\n" +
  "มรณังสุขัง อะระหังสุคะโต นะโมพุทธายะ"
  ],
  หลวงพ่อโสธร: [
  "คาถาไหว้หลวงพ่อโสธร (คาถาพระเจ้า 5 พระองค์)\n" +
  "(ท่องนะโม 3 จบ แล้วกล่าวคำบูชา)\n\n" +
  "กาเยนะ วาจายะ เจตสา วา โสธะรัง นามะ\n" +
  "อิทธิปะฏิหาริกะรัง พุทธะรูปัง อะหัง วันทามิสัพพะโสฯ\n" +
  "นะ ทรงฟ้า โม ทรงดิน พุทธ ทรงสินธุ์ ธา\n" +
  "ทรงสมุทร ยะ ทรงอากาศ\n" +
  "พุทธังแคล้วคลาด ธัมมังแคล้วคลาด\n" +
  "สังฆังแคล้วคลาด ศัตรูพาลวินาศสันติ\n" +
  "นะกาโร กุกกุสันโธ สิโรมัชเฌ\n" +
  "โมกาโร โกนาคะมะโน นานาจิตเต\n" +
  "พุทธกาโร กัสสะโป พุทโธ จะ ทะเวเนเต ธา กาโร\n" +
  "ศรีศากกะยะมุนี โคตะโม ยะกันเน\n" +
  "ยะกาโร อะริยะ เมตตรัยโย\n" +
  "ชิวหาทีเต ปัญจะพุทธา นะมามิหัง\n" +
  "พุทธะบูชา มะหาเตชะวันโต ธัมมะบูชา\n" +
  "มะหาปัญโญ สังฆะบูชา มะหาโภคะวะโห\n" +
  "อะระหังพุทโธ อิติปิโสภะคะวา นะมามิหัง"
  ],
  พระแม่ลักษมี: [
  "โอม ชยะ ศรี ลักษมี มาตา (3 จบ)\n" +
  "โอม ศรี ลักษะมิไย นะมะห์ (3 จบ)\n" +
  "โอม มหาลักษะ มิไย นะโม นะมะหะ\n" +
  "โอม วิษณุ ปรียาไย นะโม นะมะหะ\n" +
  "โอม ธะนะ ประทาไย นะโม นะมะหะ\n" +
  "โอม วิศวา จะนันไย นะโม นะมะหะ\n" +
  "ยา เทวี สะระวะ ภูเตชุ\n" +
  "ลักษมี รูเปนะ สัม สะถิตา\n" +
  "นะมัส ตัสไย นะมัส ตัสไย นะมัส ตัสไย\n" +
  "นะโม นะมะหะ"
  ],
  พระพิฆเนศ: [
  "(ตั้งนะโม 3 จบ)\n" +
  "โอม ศรีคะเนศายะ นะมะ\n" +
  "ชะยะคะเณศะ ชะยะคะเณศะ ชายะคะเณศะ\n" +
  "เทวา มาตา ชากี ปะระวะตี ปิตามะหา เทวา\n" +
  "ละฑุวัน กาโกคะ ละเค สันตะ กะเร เสวา เอกทันตะ\n" +
  "ทะยาวันดะ จาระ ภุชา ธารี มาเถ สินทูระ เสเห\n" +
  "มูเส กี อะสะวารี อันธะนะ โก อางขะ เทตะโก กายา\n" +
  "พามณะนะ โก กุตรระ เทตะ โกทินะ นิระ ทะนะ มายาฯ\n" +
  "โอม ศรีคะเนศายะ นะมะหะ\n"
  ],
  องค์พ่อทันใจ: [
  "(ตั้งนะโม 3 จบ)\n" +  
  "โอม สิทธิการิยะ ข้าแต่ท่านท้าวเทพทันใจ\n" +
  "โสโสมะมา จิตตะภะวัง มหาลาภัง\n" +
  "อิติพุทธัสสะ สุวรรณนังวา\n" +
  "ราชาตังวา มณีวา ธะนังวา\n" +
  "ภีชังวา อัตถังวา ปัตตังวา\n" +
  "เออิเอหิ อาคัจฉายะ อิติ\n" +
  "ปรารถนาอันใดพึงสำเร็จมา\n" +
  "นะมามีมา มหาลาโภ เทวะราชะ\n" +
  "กะนัง เชยยะ เชยยะ ภะวันตุเม\n"
  ],
  เจ้าแม่กวนอิม: [
  "นำโมไต๋ชื้อ ไต๋ปุย กิวโคว่\n" +
  "กิวหลั่ง กวงไต๋เล่งก้ำ กวงสี่อิมผู่สัก\n" + 
  "(ท่อง 3 จบ กราบ 3 ครั้ง)\n\n" +
  "นำโมฮุก นำโมหวบ นำโมเจ็ง นำโมกิวโคว่\n" +
  "กิวหลั่ง กวงสี่อิมผู่สัก ทั่งจี้โต โอม\n" +
  "เกียล้อฮวดโต เกียล้อฮวดโต เกียออฮวดโต\n" +
  "ล้อเกียฮวดโต ล้อเกียฮวดโต ซาผ่อออ\n" +
  "เทียงล้อซิ้ง ตี่ล้อซิ้ง นั้งลี่หลั่ง หลั่งลี่ซิ้ง\n" +
  "เจ็กเฉียก ใจ เอียงห่วยอุ่ยติ้ง\n" +
  "นำโมม่อออปวกเยี่ยปอล้อบิ๊ก\n\n" +
  "ตามด้วย\n" +
  "กวนอิมชีฟก ข้าพเจ้าชื่อ นามสกุล ขอบารมี\n" +
  "พระแม่กวนอิมช่วยข้าพเจ้าให้ประสบความสำเร็จด้าน...\n" +
  "โต้เจ่ชีฟก"
  ],
};

const DreamInterPretation = {
  น้ำ: [ 
  "จะได้รับโอกาสใหม่ๆ เข้ามาอย่างไม่ขาดสาย ทั้งในเรื่องการงาน การเงิน และความสัมพันธ์ \n" +
  "เลขเด็ดจากความฝัน : 19, 22, 26, 226, 219"
  ],
  ชายหาด: [ 
  "การงานจะรุ่งเรือง อาจจะได้เลื่อนขั้น และยังมีโอกาสที่จะได้ไปต่างประเทศ หรือต่างจังหวัด เพื่อตามหาโอกาสใหม่ๆ ของการทำธุรกิจ \n" +
  "เลขเด็ดจากความฝัน : 55, 15, 61, 546, 116"
  ],
  จอมปลวก: [ 
  "ได้รับโชคลาภ เพราะจอมปลวกเป็นสัญลักษณ์ของสิ่งศักดิ์สิทธิ์ จึงทำให้มีดวงที่จะได้รับโชคเรื่องการเสี่ยงดวง หรือเรื่องหวย จึงทำให้เป็นโอกาสที่ดีในการเริ่มต้นใหม่ในการทำธุรกิจอีกด้วย \n" +
  "เลขเด็ดจากความฝัน : 88, 98, 99, 819, 969"
  ],
  พายุหมุน: [ 
  "จะมีเกณฑ์ได้ย้ายที่อยู่ หรือได้ทำความรู้จักกับคนต่างถิ่น ชีวิตจะมีความเปลี่ยนแปลง และได้รับโชคลาภมากมาย \n" +
  "เลขเด็ดจากความฝัน : 10, 02, 00, 112, 110"
  ],
  ภูเขา: [ 
  "ชีวิตตอนนี้จะมีแต่เรื่องดีๆ ถือเป็นช่วงขาขึ้นของชีวิตเลย ไม่ว่าจะเรื่องการงาน การเงิน สุขภาพ หรือความรัก และใครที่พบเจอแต่เรื่องไม่ดี ชีวิตก็จะค่อยๆ ดีขึ้นด้วยเช่นกัน \n" +
  "เลขเด็ดจากความฝัน : 91, 92, 96, 096, 191"
  ],
  ดอกกุหลาบ: [ 
  "จะมีโชคเรื่องความรักอย่างแน่นอน คนที่มีแฟนอยู่แล้วก็จะมีความสัมพันธ์ที่ราบรื่นขึ้น และมีเกณฑ์จะได้สร้างครอบครัว ส่วนคนโสดก็มีโอกาสได้เจอเนื้อคู่ด้วยเช่นกัน \n" +
  "เลขเด็ดจากความฝัน : 32, 42, 63, 69, 463, 396"
  ],
  ดอกไม้สีขาว: [ 
  "มีดวงเรื่องความรักที่จะได้เจอคู่แท้ หรือคนที่มีแฟนอยู่แล้วก็รักกันมากยิ่งขึ้น นอกจากนี้ ยังแสดงถึงการเป็นที่รัก ซึ่งส่งเสริมให้มีดวงในการได้รับความเมตตาจากผู้ใหญ่ด้วย \n" +
  "เลขเด็ดจากความฝัน : 21, 99, 291, 289, 929"
  ],
  ผู้หญิง: [ 
  "หากได้ทำงานกับเพศหญิงจะได้รับโชคลาภ และการทำงานก็จะเป็นไปด้วยดี การเงินก็จะคล่องตัวมากขึ้น \n" +
  "เลขเด็ดจากความฝัน : 5 "
  ],
  คนท้อง: [ 
  "การงาน หรือธุรกิจจะเจริญรุ่งเรืองมากขึ้น และมีเกณฑ์จะได้ลาภก้อนใหญ่ \n" +
  "เลขเด็ดจากความฝัน : 6 "
  ],
  หญิงแก่ชรา: [ 
  "มีเกณฑ์ได้รับความช่วยเหลือจากคนรอบข้าง เพื่อให้การงานราบรื่นมากยิ่งขึ้น ในส่วนของดวงความรัก คนโสดจะมีเกณฑ์ได้ทำความรู้จักกับคนใหม่ๆ \n" +
  "'เลขเด็ดจากความฝัน : 9"
  ],
  ตำรวจ: [ 
  "ในด้านการเงินจะได้รับโชคลาภ และถ้าหากใครกำลังเจอเรื่องแย่ๆ ก็จะผ่านพ้นไปได้ด้วยดี ไม่ว่าทุกข์แบบไหนก็จะหมดทุกข์หมดโศกไปได้ \n" +
  "เลขเด็ดจากความฝัน : 4"
  ],
  ไก่:[ 
  "มีเกณฑ์จะได้รับโชคทางการเงิน หรือจะมีคนนำโชคลาภมาให้ และอาจจะมีลาภลอยเกิดขึ้นกับตัวเองได้ \n" +
  "เลขเด็ดจากความฝัน : 9, 0, 3"
  ],
  งู:[ 
  "หากเป็นคนโสด มีเกณฑ์จะได้พบรักแบบกะทันหัน และหากเป็นคนที่มีคู่ หรือมีครอบครัวอยู่แล้ว มีโอกาสที่จะมีบุตรได้ \n" +
  "เลขเด็ดจากความฝัน : 5, 9, 6, 4"
  ],
  จิ้งจก:[ 
  "จะมีลาภจากการเสี่ยงโชค หากเป็นในเรื่องของงาน จะได้รับข่าวดีจากเพื่อนร่วมงาน หรือหัวหน้า \n" +
  "เลขเด็ดจากความฝัน : 17, 149"
  ],
  ช้าง:[ 
  "จะได้รับโชคจากการเดินทาง อาจได้รับโชคจากผู้หลักผู้ใหญ่ที่เคารพนับถือ \n" +
  "เลขเด็ดจากความฝัน : 7, 1"
  ],
  ตะขาบ:[ 
  "จะมีเพศตรงข้ามเข้ามาทำความรู้จัก หรือทำความสนิทสนมในเชิงชู้สาว \n" +
  "เลขเด็ดจากความฝัน : 6, 8, 3"
  ],
};

/*====================================================================================================================================================*/

function generateHoroscope(day) {
  if (horoscopes.hasOwnProperty(day)) {
    const horoscopesOfDay = horoscopes[day];
    const randomIndex = Math.floor(Math.random() * horoscopesOfDay.length);
    return horoscopesOfDay[randomIndex];
  } else {
    return null;
  }
}

/*====================================================================================================================================================*/

function getFortune(place) {
  if (fortunes.hasOwnProperty(place)) {
    const fortunesOfวัด = fortunes[place];
    const randomIndex = Math.floor(Math.random() * fortunesOfวัด.length);
    return fortunesOfวัด[randomIndex];
  } else {
    return null;
  }
}

/*====================================================================================================================================================*/

function getTarotReading(place) {
  if (tarotCards.hasOwnProperty(place)) {
    const tarotOfPlace = tarotCards[place];
    const randomIndex = Math.floor(Math.random() * tarotOfPlace.length);
    return tarotOfPlace[randomIndex];
  } else {
    return null;
  }
}

/*====================================================================================================================================================*/

function getSelectedCard(cardName) {
  const meaning = tarotMean[cardName];
  if (meaning) {
    return { cardName, meaning };
  } else {
    return { error: "ไม่พบความหมายสำหรับการ์ดที่ระบุ" };
  }
}

/*====================================================================================================================================================*/

function getPrayer(place) {
  const selectedPrayers = Prayers[place];
  if (selectedPrayers) {
    const randomIndex = Math.floor(Math.random() * selectedPrayers.length);
    const prayerText = selectedPrayers[randomIndex];
    return { name: place, prayer: prayerText }; // เพิ่มการส่งชื่อและบทสวด
  } else {
    return { error: "ไม่พบสถานที่ที่ระบุในรายการของคำอธิษฐาน" };
  }
}

/*====================================================================================================================================================*/

function getDreamPrediction(dreamName) {
  const interpretation = DreamInterPretation[dreamName];
  if (interpretation) {
    return { keyword: dreamName, meaning: interpretation };
  } else {
    return { error: "ไม่พบการทำนายสำหรับความฝันที่ระบุ" };
  }
}

/*====================================================================================================================================================*/

app.get('/api/horoscope/:day', (req, res) => {
  const day = req.params.day;
  const horoscope = generateHoroscope(day);
  res.json({ horoscope });
});

/*====================================================================================================================================================*/

app.get('/api/fortune/:place', (req, res) => {
  const place = req.params.place;
  const fortune = getFortune(place);
  res.json({ fortune });
});

/*====================================================================================================================================================*/

app.get('/api/tarot/:place', (req, res) => {
  const place = req.params.place;
  const tarotReading = getTarotReading(place);
  res.json({ tarotReading });
});

/*====================================================================================================================================================*/

app.get('/api/tarotmean/:cardName', (req, res) => {
  const cardName = req.params.cardName;
  const selectedCard = getSelectedCard(cardName);
  res.json(selectedCard);
});

/*====================================================================================================================================================*/

app.get('/api/prayer/:place', (req, res) => {
  const place = req.params.place;
  const prayer = getPrayer(place);
  res.json({ prayer });
});

/*====================================================================================================================================================*/

app.get('/api/dream-predictions/:dreamName', (req, res) => {
  const dreamName = req.params.dreamName;
  const dreamPrediction = getDreamPrediction(dreamName);
  res.json(dreamPrediction);
});

/*====================================================================================================================================================*/

app.listen(port, () => {
  console.log(`Server is running on port ${port}`);
});

/*====================================================================================================================================================*/

//ใช้ลิ้ง http://10.0.2.2:5000/api/.../...