const express = require('express');
const cors = require('cors');

const bodyParser = require('body-parser');
const app = express();
const port = process.env.PORT || 5000;

app.use(cors({
    origin: '*'
  }));
  app.use(bodyParser.json());

  const tarotMean = {
    "the fool": [
      "การงาน: เริ่มต้นงานใหม่ กิจการใหม่ ลาออกจากงานเพื่อพักผ่อน หรือออกมาทำในสิ่งที่รัก รวมไปถึงการถูกไล่ออก ซึ่งล้วนมีความเสี่ยง ต้องรอบคอบและประเมินความเสี่ยงให้ดี อย่ามองโลกในแง่ดีเกินไป ไพ่ใบนี้อาจหมายถึงงานที่เกี่ยวกับการเดินทาง งานที่ได้พบเจอผู้คนบ่อยๆได้ด้วย\n\n" +
      "การเงิน: มีเงินมาก แต่ใช้เงินเก่ง และเก็บเงินไม่เก่ง ขาดวินัยทางการเงิน มักใช้จ่ายเกินตัวเพราะทำตามใจตัวเอง ด้านการลงทุนถือว่ามีความเสี่ยง ต้องศึกษาและวิเคราะห์ความเสี่ยงให้ดีก่อนการลงทุน ต้องระวังเรื่องการกู้ยืมหรือการใช้บัตรเครดิต\n\n" +
      "ความรัก: เป็นคนเจ้าชู้ คนโสดมีโอกาสได้เจอคนใหม่ๆ แต่เราอาจจะรักสนุก รักอิสระอยู่ จึงไม่พร้อมผูกมัดกับใคร คนมีคู่ ต้องระวังการทำร้ายจิตใจคู่รัก อาจไม่ค่อยสนใจหรือใส่ใจเท่าที่ควร ในอีกบริบทหนึ่ง ไพ่ใบนี้อาจหมายถึงการที่เรารักใครมากๆ โดยไม่สนใจว่าเราจะผิดหวัง\n\n" +
      "สุขภาพ: ต้องระวังอุบัติเหตุที่เกิดจากความประมาท ตกจากที่สูง เพราะความประมาท หากเป็นคนที่กำลังจะท่องเที่ยวหรือเดินทาง ระวังอุบัติเหตุในการเดินทาง หรือไปในสถานที่อันตราย\n\n" +
      "ไพ่กลับหัว: การเปลี่ยนแปลงและความไม่แน่นอน ไม่ได้วางแผนรับมือกับอนาคต ใช้ชีวิตแบบไม่กลัวอันตรายเพราะประมาท"
    ],
    "magician": [
      "การงาน: เป็นคนสื่อสารเก่ง ฉลาด เรียนรู้เร็ว ทำงานดี นำเสนอเก่ง เหมาะกับงานที่เกี่ยวข้องกับการสื่อสาร งานที่พบปะผู้คนจำนวนมาก\n\n" +
      "การเงิน: หาเงินเก่ง พูดจาเป็นเงินเป็นทอง การเงินคล่องตัว ไม่ขาดมือ แต่ก็ใช้จ่ายเก่งเช่นกัน ไม่ค่อยมีเงินเก็บ เพราะได้มาก็ใช้หมด\n\n" +
      "ความรัก: คนโสดจะพบคนคุยใหม่ แต่ต้องระวังเจอคนไม่จริงใจ เข้ามาฉวยโอกาส เล่ห์เหลี่ยมใส่ หรืออาจะเป็นคนที่ดีแต่ปาก พูดเก่ง แต่อาจไม่ได้เก่งอย่างที่คิด สำหรับคนมีคู่ หากมีเรื่องไม่เข้าใจกัน ตอนนี้ถือเป็นโอกาสที่ดี ที่จะพูดคุยปรับความเข้าใจกัน\n\n" +
      "สุขภาพ: ระวังโรคเกี่ยวกับทางเดินหายใจ ภูมิแพ้ โรคเครียด โรคจิตเวช\n\n" +
      "ไพ่กลับหัว: เกี่ยวกับความไม่ซื่อ การหลอกลวง ความสัมพันธ์ที่เหมือนจะดี อาจจะมีอะไรแอบแฝงอยู่"
    ],
  };

  function getSelectedCard(cardName) {
    const meaning = tarotMean[cardName];
    if (meaning) {
      return { cardName, meaning };
    } else {
      return { error: "ไม่พบความหมายสำหรับการ์ดที่ระบุ" };
    }
  }


  app.get('/api/tarotmean/:cardName', (req, res) => {
    const cardName = req.params.cardName;
    const selectedCard = getSelectedCard(cardName);
    res.json(selectedCard);
  });
  

app.listen(port, () => {
    console.log(`Server is running on port ${port}`);
  });